/* OID.strings
/*
/* This file maps object identifiers (OIDs) to their corresponding labels.
/* These labels are used when displaying the details of a certificate's contents.
/*
/* NOTE TO LOCALIZERS:
/*
/* All strings in this file should eventually be localized. However, not all of them are
/* currently localizable. Specifically, there are a number of acronymns and abbreviations
/* which still need to be expanded into the corresponding English words. [3751398]
/*
/* Acronymns, such as "RSA," "DES," "X.509," "S/MIME," and so on, should be left alone for now.
/* Abbreviated labels such as "id-aa-dvcs-dvc" should also not be localized if present.


/* Deutsche Telekom */

"06 05 02 82 06 01 0A"			= "Telesec";
"06 06 02 82 06 01 0A 00"		= "Telesec-uitbreiding";
"06 06 02 82 06 01 0A 01"		= "Telesec-mechanisme";

"06 07 02 82 06 01 0A 01 00"	= "Telesec-identiteitscontrole";
"06 08 02 82 06 01 0A 01 00 01"	= "Identiteitscontrole met wachtwoord";
"06 08 02 82 06 01 0A 01 00 02" = "Identiteitscontrole met beveiligd wachtwoord";
"06 08 02 82 06 01 0A 01 00 03" = "Eenrichtings-X.509-identiteitscontrole";
"06 08 02 82 06 01 0A 01 00 04" = "Tweerichtings-X.509-identiteitscontrole";
"06 08 02 82 06 01 0A 01 00 05" = "Drierichtings-X.509-identiteitscontrole";
"06 08 02 82 06 01 0A 01 00 06" = "Eenrichtings-SO9798-identiteitscontrole";
"06 08 02 82 06 01 0A 01 00 07" = "Tweerichtings-ISO9798-identiteitscontrole";
"06 08 02 82 06 01 0A 01 00 08" = "Telekom-identiteitscontrole";

"06 07 02 82 06 01 0A 01 01"	= "Telesec-handtekening";
"06 08 02 82 06 01 0A 01 01 01"	= "MD4 met RSA en ISO9697";
"06 08 02 82 06 01 0A 01 01 02"	= "MD4 met RSA en Telesec-handtekeningstandaard";
"06 08 02 82 06 01 0A 01 01 03"	= "MD5 met RSA en ISO9697";
"06 08 02 82 06 01 0A 01 01 04"	= "MD5 met RSA en Telesec-handtekeningstandaard";
"06 08 02 82 06 01 0A 01 01 05"	= "RIPEMD-160 met RSA en Telekom-handtekeningstandaard";
"06 08 02 82 06 01 0A 01 01 09"	= "HBCI RSA-handtekening";

"06 07 02 82 06 01 0A 01 02"	= "Telesec-codering";
"06 08 02 82 06 01 0A 01 02 00"	= "geen";
"06 08 02 82 06 01 0A 01 02 01"	= "RSA Telesec";
"06 08 02 82 06 01 0A 01 02 02"	= "DES";
"06 09 02 82 06 01 0A 01 02 02 01"	= "DES ECB";
"06 09 02 82 06 01 0A 01 02 02 02"	= "DES CBC";
"06 09 02 82 06 01 0A 01 02 02 03"	= "DES OFB";
"06 09 02 82 06 01 0A 01 02 02 04"	= "DES CFB8";
"06 09 02 82 06 01 0A 01 02 02 05"	= "DES CFB64";
"06 08 02 82 06 01 0A 01 02 03"	= "3DES";
"06 09 02 82 06 01 0A 01 02 03 01"	= "3DES ECB";
"06 09 02 82 06 01 0A 01 02 03 02"	= "3DES CBC";
"06 09 02 82 06 01 0A 01 02 03 03"	= "3DES OFB";
"06 09 02 82 06 01 0A 01 02 03 04"	= "3DES CFB8";
"06 09 02 82 06 01 0A 01 02 03 05"	= "3DES CFB64";
"06 08 02 82 06 01 0A 01 02 04"	= "Magenta";
"06 08 02 82 06 01 0A 01 02 05"	= "IDEA";
"06 09 02 82 06 01 0A 01 02 05 01"	= "IDEA ECB";
"06 09 02 82 06 01 0A 01 02 05 02"	= "IDEA CBC";
"06 09 02 82 06 01 0A 01 02 05 03"	= "IDEA OFB";
"06 09 02 82 06 01 0A 01 02 05 04"	= "IDEA CFB8";
"06 09 02 82 06 01 0A 01 02 05 05"	= "IDEA CFB64";

"06 07 02 82 06 01 0A 01 03"	= "Eenrichtingsfunctie";
"06 08 02 82 06 01 0A 01 03 01"	= "MD4";
"06 08 02 82 06 01 0A 01 03 02"	= "MD5";
"06 08 02 82 06 01 0A 01 03 03"	= "SqModN-X509";
"06 08 02 82 06 01 0A 01 03 04"	= "SqModN-ISO";
"06 08 02 82 06 01 0A 01 03 05"	= "RIPEMD-128";
"06 08 02 82 06 01 0A 01 03 06"	= "Hash door middel van blokcode";
"06 08 02 82 06 01 0A 01 03 07"	= "MAC";
"06 08 02 82 06 01 0A 01 03 08"	= "RIPEMD-160";

"06 07 02 82 06 01 0A 01 04"	= "FEC-functie";
"06 08 02 82 06 01 0A 01 04 01"	= "Reed Solomon";

"06 06 02 82 06 01 0A 02"		= "Telesec-module";
"06 07 02 82 06 01 0A 02 00"	= "Algoritmes";
"06 07 02 82 06 01 0A 02 01"	= "Typen kenmerken";
"06 07 02 82 06 01 0A 02 02"	= "Typen certificaten";
"06 07 02 82 06 01 0A 02 03"	= "Typen berichten";
"06 07 02 82 06 01 0A 02 04"	= "PL-protocol";
"06 07 02 82 06 01 0A 02 05"	= "SME en SME-componenten";
"06 07 02 82 06 01 0A 02 06"	= "FEC";
"06 07 02 82 06 01 0A 02 07"	= "Nuttige definities";
"06 07 02 82 06 01 0A 02 08"	= "STE-bestanden";
"06 07 02 82 06 01 0A 02 09"	= "SAdmin";
"06 07 02 82 06 01 0A 02 0A"	= "Elektronische bestelling";
"06 07 02 82 06 01 0A 02 0B"	= "Asymmetrische Telesec TTP-applicatie";
"06 07 02 82 06 01 0A 02 0C"	= "Telesec TTP-basisapplicatie";
"06 07 02 82 06 01 0A 02 0D"	= "Telesec TTP-berichten";
"06 07 02 82 06 01 0A 02 0E"	= "Telesec TTP-tijdstempelapplicatie";

"06 06 02 82 06 01 0A 03"		= "Objectklasse";
"06 07 02 82 06 01 0A 03 00"	= "Telesec - andere naam";
"06 07 02 82 06 01 0A 03 01"	= "Adreslijst";
"06 07 02 82 06 01 0A 03 02"	= "Directorytype";
"06 07 02 82 06 01 0A 03 03"	= "Directorygroep";
"06 07 02 82 06 01 0A 03 04"	= "Directorygebruiker";
"06 07 02 82 06 01 0A 03 05"	= "Symmetrische sleutelvermelding";

"06 06 02 82 06 01 0A 04"		= "Pakket";
"06 06 02 82 06 01 0A 05"		= "Parameter";
"06 06 02 82 06 01 0A 06"		= "Naambinding";
"06 06 02 82 06 01 0A 07"		= "Kenmerk";
"06 07 02 82 06 01 0A 07 00"	= "Groepsidentificatie applicatie";
"06 07 02 82 06 01 0A 07 01"	= "Certificaattype";
"06 07 02 82 06 01 0A 07 02"	= "Telesec-certificaat";
"06 07 02 82 06 01 0A 07 03"	= "Certificaatnummer";
"06 07 02 82 06 01 0A 07 04"	= "Lijst met ingetrokken certificaten";
"06 07 02 82 06 01 0A 07 05"	= "Aanmaakdatum";
"06 07 02 82 06 01 0A 07 06"	= "Verstrekker";
"06 07 02 82 06 01 0A 07 07"	= "Naamgevingsautoriteit";
"06 07 02 82 06 01 0A 07 08"	= "Publieke-sleuteldirectory";
"06 07 02 82 06 01 0A 07 09"	= "Beveiligingsdomein";
"06 07 02 82 06 01 0A 07 0A"	= "Onderwerp";
"06 07 02 82 06 01 0A 07 0B"	= "Tijdstip van intrekking";
"06 07 02 82 06 01 0A 07 0C"	= "Verwijzing naar gebruikersgroep";
"06 07 02 82 06 01 0A 07 0D"	= "Geldigheid";
"06 07 02 82 06 01 0A 07 0E"	= "ZERT93";
"06 07 02 82 06 01 0A 07 0F"	= "Omgeving beveiligingsbericht";
"06 07 02 82 06 01 0A 07 10"	= "Anonieme publieke-sleuteldirectory";
"06 07 02 82 06 01 0A 07 11"	= "Telesec-voornaam";
"06 07 02 82 06 01 0A 07 12"	= "Aanvullingen op naam";
"06 07 02 82 06 01 0A 07 13"	= "Telesec-postcode";
"06 07 02 82 06 01 0A 07 14"	= "Naamsonderscheiding";
"06 07 02 82 06 01 0A 07 15"	= "Lijst met Telesec-certificaten";
"06 07 02 82 06 01 0A 07 16"	= "Lijst met Teletrust-certificaten";
"06 07 02 82 06 01 0A 07 17"	= "Lijst met X.509-certificaten";
"06 07 02 82 06 01 0A 07 18"	= "Verstrekkingstijdstip";
"06 07 02 82 06 01 0A 07 19"	= "Nummer fysieke kaart";
"06 07 02 82 06 01 0A 07 1A"	= "Bestandstype";
"06 07 02 82 06 01 0A 07 1B"	= "Ctl-bestand is archief";
"06 07 02 82 06 01 0A 07 1C"	= "E-mailadres";
"06 07 02 82 06 01 0A 07 1D"	= "Lijst met certificaatsjablonen";
"06 07 02 82 06 01 0A 07 1E"	= "Directorynaam";
"06 07 02 82 06 01 0A 07 1F"	= "Naam directorytype";
"06 07 02 82 06 01 0A 07 20"	= "Naam directorygroep";
"06 07 02 82 06 01 0A 07 21"	= "Naam directorygebruiker";
"06 07 02 82 06 01 0A 07 22"	= "Intrekkingsmarkering";
"06 07 02 82 06 01 0A 07 23"	= "Naam symmetrische sleutelvermelding";
"06 07 02 82 06 01 0A 07 24"	= "GL-nummer";
"06 07 02 82 06 01 0A 07 25"	= "GO-nummer";
"06 07 02 82 06 01 0A 07 26"	= "G-sleutelgegevens";
"06 07 02 82 06 01 0A 07 27"	= "Z-sleutelgegevens";
"06 07 02 82 06 01 0A 07 28"	= "KT-sleutelgegevens";
"06 07 02 82 06 01 0A 07 2A"	= "KT-sleutelnummer";
"06 07 02 82 06 01 0A 07 33"	= "Tijdstip waarop intrekking is aangemaakt";
"06 07 02 82 06 01 0A 07 34"	= "Aansprakelijkheidstekst";

"06 06 02 82 06 01 0A 08"		= "Kenmerkgroep";
"06 06 02 82 06 01 0A 09"		= "Taak";
"06 06 02 82 06 01 0A 0A"		= "Berichtgeving";
"06 06 02 82 06 01 0A 0B"		= "SNMP-MIBS";

"06 07 02 82 06 01 0A 0B 01"	= "Beveiliginsapplicatie";

"06 06 02 82 06 01 0A 0C"		= "Definities van Cert- en CRL-uitbreidingen";

"06 07 02 82 06 01 0A 0C 00"	= "Aansprakelijkheidsbeperkinguitbreiding van Cert-uitbreiding ";
"06 07 02 82 06 01 0A 0C 01"	= "Telesec-certificaatcode-uitbreiding";
"06 07 02 82 06 01 0A 0C 02"	= "Telesec-beleidsidentificatie";
"06 07 02 82 06 01 0A 0C 03"	= "Telesec-beleidskwalificatiecode";
"06 07 02 82 06 01 0A 0C 04"	= "Uitbreiding gefilterde Telesec-CRL";
"06 07 02 82 06 01 0A 0C 05"	= "Uitbreiding Telesec-CRL-filter";
"06 07 02 82 06 01 0A 0C 06"	= "Uitbreiding Telesec-naamgevingsautoriteit";

/* RFC 1274 (X.500 attribute collection from the UK, thus the weird OID). */

"06 0A 09 92 26 89 93 F2 2C 64 01 01"	= "Gebruikers-ID";
"06 0A 09 92 26 89 93 F2 2C 64 01 03"	= "RFC822-postbus";

/* RFC 2247 */

"06 0A 09 92 26 89 93 F2 2C 64 01 19"	= "Domeincomponent";

/* Australian Government */

"06 06 2A 24 01 82 4D 01"   = "Australisch bedrijfsnummer";

/* Certificates Australia */

"06 0A 2A 24 A4 97 A3 53 01 64 01 01"	= "Beleidsidentificatie certificaten Australië";

/* Signet */

"06 09 2A 24 A0 F2 A0 7D 01 01 02"	= "Signet Personal";
"06 09 2A 24 A0 F2 A0 7D 01 01 03"	= "Signet Business";
"06 09 2A 24 A0 F2 A0 7D 01 01 04"	= "Signet Legal";
"06 09 2A 24 A0 F2 A0 7D 01 01 0A"	= "Signet Pilot";
"06 09 2A 24 A0 F2 A0 7D 01 01 0B"	= "Signet IntraNet";
"06 09 2A 24 A0 F2 A0 7D 01 01 14"	= "Signet-beleidsidentificatie";

/* Mitsubishi */

"06 0B 2A 83 08 8C 1A 4B 3D 01 01 01"		= "Symmetrische-coderingsalgoritme";
"06 0C 2A 83 08 8C 9A 4B 3D 01 01 01 01"	= "MISTY1-CBC";

/* SEIS */

"06 05 2A 85 70 22 01"		= "SEIS CP";
"06 06 2A 85 70 22 01 01"	= "SEIS High-Assurance-beleidsidentificatie";
"06 06 2A 85 70 22 01 02"	= "SEIS GAK-beleidsidentificatie";
"06 05 2A 85 70 22 02"		= "SEIS PE";
"06 05 2A 85 70 22 03"		= "SEIS AT";
"06 06 2A 85 70 22 03 01"	= "SEIS AT Personal-identificatie";

/* ANSI X9.57 */

"06 06 2A 86 48 CE 38 01"		= "ANSI X9.57-module";
"06 07 2A 86 48 CE 38 01 01"	= "X9F1-certificaatbeheer";
"06 06 2A 86 48 CE 38 02"		= "Blokkeringsinstructie";
"06 07 2A 86 48 CE 38 02 01"	= "Blokkeringsinstructie-Geen";
"06 07 2A 86 48 CE 38 02 02"	= "Oproepverstrekker";
"06 07 2A 86 48 CE 38 02 03"	= "Keur af";
"06 07 2A 86 48 CE 38 02 04"	= "Pickup-teken";
"06 06 2A 86 48 CE 38 03"		= "Kenmerk";
"06 06 2A 86 48 CE 38 03 01"	= "Controlehandtekening";
"06 06 2A 86 48 CE 38 03 02"	= "Kenmerkcertificaat";
"06 06 2A 86 48 CE 38 04"		= "Algoritme";
"06 07 2A 86 48 CE 38 04 01"	= "DSA";
"06 07 2A 86 48 CE 38 04 02"	= "DSA-overeenkomst";
"06 07 2A 86 48 CE 38 04 03"	= "DSA met SHA-1";

/* ANSI X9.62 */

"06 06 2A 86 48 CE 3D 01"		= "ANSI X9.62-veldtype";
"06 07 2A 86 48 CE 3D 01 01"	= "Primair veld";
"06 07 2A 86 48 CE 3D 01 02"	= "Karakteristiek-Twee-veld";
"06 09 2A 86 48 CE 3D 01 02 03"	= "Karakteristiek-Twee-basis";
"06 0A 2A 86 48 CE 3D 01 02 03 01"	= "Lege basis";
"06 0A 2A 86 48 CE 3D 01 02 03 02"	= "Drietermige basis";
"06 0A 2A 86 48 CE 3D 01 02 03 03"	= "Vijftermige basis";
"06 06 2A 86 48 CE 3D 02"		= "Type publieke sleutel";
"06 07 2A 86 48 CE 3D 02 01"	= "Publieke sleutel met elliptische curve";

/* ANSI X9.42 */

"06 06 2A 86 48 CE 3E 01"		= "ANSI X9.42-veldtype";
"06 07 2A 86 48 CE 3E 01 01"	= "Galois-veld priemgetal";
"06 06 2A 86 48 CE 3E 02"		= "Type nummer";
"06 07 2A 86 48 CE 3E 02 01"	= "Publieke Diffie-Hellman-sleutel";
"06 06 2A 86 48 CE 3E 03"		= "Systeem";
"06 07 2A 86 48 CE 3E 03 01"	= "Diffie-Hellman statisch";
"06 07 2A 86 48 CE 3E 03 02"	= "Diffie-Hellman efemerisch";
"06 07 2A 86 48 CE 3E 03 03"	= "Diffie-Hellman hybride 1";
"06 07 2A 86 48 CE 3E 03 04"	= "Diffie-Hellman hybride 2";
"06 07 2A 86 48 CE 3E 03 05"	= "MQV2";
"06 07 2A 86 48 CE 3E 03 06"	= "MQV1";

/* Nortel Secure Networks/Entrust */

"06 07 2A 86 48 86 F6 7D 07"		= "NSN";
"06 08 2A 86 48 86 F6 7D 07 41"		= "NSN-CE";
"06 09 2A 86 48 86 F6 7D 07 41 00"	= "Entrust-versie-info";
"06 08 2A 86 48 86 F6 7D 07 42"		= "NSN-Alg";
"06 09 2A 86 48 86 F6 7D 07 42 03"	= "CAST3-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0A"	= "CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0B"	= "CAST5-MAC";
"06 09 2A 86 48 86 F6 7D 07 42 0C"	= "PBE with MD5 and CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0D"	= "MAC op wachtwoordbasis";
"06 08 2A 86 48 86 F6 7D 07 43"		= "NSN-OC";
"06 09 2A 86 48 86 F6 7D 07 43 0C"	= "Entrust-gebruiker";
"06 08 2A 86 48 86 F6 7D 07 44"		= "NSN-AT";
"06 09 2A 86 48 86 F6 7D 07 44 00"	= "Entrust CA-info";
"06 09 2A 86 48 86 F6 7D 07 44 0A"	= "Kenmerkcertificaat";

/* PKCS #1 */

"06 08 2A 86 48 86 F7 0D 01 01"		= "PKCS-1";
"06 09 2A 86 48 86 F7 0D 01 01 01"	= "RSA-codering";
"06 09 2A 86 48 86 F7 0D 01 01 02"	= "MD2 met RSA-codering";
"06 09 2A 86 48 86 F7 0D 01 01 03"	= "MD4 met RSA-codering";
"06 09 2A 86 48 86 F7 0D 01 01 04"	= "MD5 met RSA-codering";
"06 09 2A 86 48 86 F7 0D 01 01 05"	= "SHA-1 met RSA-codering";
"06 09 2A 86 48 86 F7 0D 01 01 06"	= "RSA-OAEP-codering (SET)";
"06 09 2A 86 48 86 F7 0D 01 01 07"	= "RSA-OAEP-codering";
"06 09 2A 86 48 86 F7 0D 01 01 08"	= "RSA-OAEP-MGF";
"06 09 2A 86 48 86 F7 0D 01 01 09"	= "RSA-OAEP met opgegeven label";
"06 09 2A 86 48 86 F7 0D 01 01 0A"	= "RSA-PSS-handtekeningschema";
"06 09 2A 86 48 86 F7 0D 01 01 0B"	= "SHA-256 met RSA-codering";
"06 09 2A 86 48 86 F7 0D 01 01 0C"	= "SHA-384 met RSA-codering";
"06 09 2A 86 48 86 F7 0D 01 01 0D"	= "SHA-512 met RSA-codering";
"06 09 2A 86 48 86 F7 0D 01 01 0E"	= "SHA-224 met RSA-codering";

/* BSAFE/PKCS #2 (obsolete) */

"06 08 2A 86 48 86 F7 0D 01 02"		= "BSAFE RSA-codering";

/* PKCS #3 */

"06 08 2A 86 48 86 F7 0D 01 03"		= "PKCS-3";
"06 09 2A 86 48 86 F7 0D 01 03 01"	= "Diffie-Hellman-sleutelovereenkomt";

/* PKCS #5 */

"06 08 2A 86 48 86 F7 0D 01 05"		= "PKCS-5";
"06 09 2A 86 48 86 F7 0D 01 05 01"	= "PBE met MD2 en DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 03"	= "PBE with MD5 and DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 04"	= "PBE with MD2 and RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 06"	= "PBE with MD5 and RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 09"	= "PBE met MD5 en XOR";
"06 09 2A 86 48 86 F7 0D 01 05 0A"	= "PBE met SHA en DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 0C"	= "PKCS-5 PBKDF2";
"06 09 2A 86 48 86 F7 0D 01 05 0D"	= "PKCS-5 PBES2";
"06 09 2A 86 48 86 F7 0D 01 05 0E"	= "PKCS-5 PBMAC1";

/* PKCS #7 */

"06 08 2A 86 48 86 F7 0D 01 07"		= "PKCS-7";
"06 09 2A 86 48 86 F7 0D 01 07 01"	= "Gegevens";
"06 09 2A 86 48 86 F7 0D 01 07 02"	= "Ondertekende gegevens";
"06 09 2A 86 48 86 F7 0D 01 07 03"	= "Ingepakte gegevens";
"06 09 2A 86 48 86 F7 0D 01 07 04"	= "Ondertekende en ingepakte gegevens";
"06 09 2A 86 48 86 F7 0D 01 07 05"	= "Verwerkte gegevens";
"06 09 2A 86 48 86 F7 0D 01 07 06"	= "Gecodeerde gegevens";
"06 09 2A 86 48 86 F7 0D 01 07 07"	= "Gegevens met kenmerken";
"06 09 2A 86 48 86 F7 0D 01 07 08"	= "Info over gecodeerde private sleutel";

/* PKCS #9 */

"06 08 2A 86 48 86 F7 0D 01 09"		= "PKCS-9";
"06 09 2A 86 48 86 F7 0D 01 09 01"	= "E-mailadres";
"06 09 2A 86 48 86 F7 0D 01 09 02"	= "Niet-gestructureerde naam";
"06 09 2A 86 48 86 F7 0D 01 09 03"	= "Type inhoud";
"06 09 2A 86 48 86 F7 0D 01 09 04"	= "Berichtverwerking";
"06 09 2A 86 48 86 F7 0D 01 09 05"	= "Ondertekeningstijdstip";
"06 09 2A 86 48 86 F7 0D 01 09 06"	= "Controlehandtekening";
"06 09 2A 86 48 86 F7 0D 01 09 07"	= "Wachtwoordcontrole";
"06 09 2A 86 48 86 F7 0D 01 09 08"	= "Niet-gestructureerd adres";
"06 09 2A 86 48 86 F7 0D 01 09 09"	= "Uitgebreide certificaatkenmerken";
"06 09 2A 86 48 86 F7 0D 01 09 0A"	= "Verstrekker en serienummer";
"06 09 2A 86 48 86 F7 0D 01 09 0B"	= "Wachtwoordcontrole";
"06 09 2A 86 48 86 F7 0D 01 09 0C"	= "Publieke sleutel";
"06 09 2A 86 48 86 F7 0D 01 09 0D"	= "Ondertekeningsbeschrijving";
"06 09 2A 86 48 86 F7 0D 01 09 0E"	= "Uitbreidingverzoek";

/* PKCS #9 for use with S/MIME */

"06 09 2A 86 48 86 F7 0D 01 09 0F"		= "S/MIME-mogelijkheden";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 01"	= "Voorkeur voor ondertekende gegevens";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 02"	= "Kan niets decoderen";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 03"	= "Verzoek om ontvangstbewijs";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 04"	= "Ontvangstbewijs";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 05"	= "Inhoudaanwijzingen";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 06"	= "Maillijstuitbreidingsgeschiedenis";

"06 09 2A 86 48 86 F7 0D 01 09 10"			= "S/MIME";

/* S/MIME Modules */

"06 0A 2A 86 48 86 F7 0D 01 09 10 00"		= "S/MIME-modules";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 01"	= "Syntaxis cryptografisch bericht";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 02"	= "Uitgebreide beveiligingsvoorzieningen";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 03"	= "S/MIME-objectidentificatie";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 04"	= "S/MIME V3-bericht";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 05"	= "Elektronische ETS-handtekening 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 06"	= "Elektronische ETS-handtekening 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 07"	= "Elektronisch ETS-handtekeningbeleid 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 08"	= "Elektronisch ETS-handtekeningbeleid 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 09"	= "id-mod-certdist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0A"	= "id-mod-domsec";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0B"	= "id-mod-compress";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0C"	= "id-mod-symkeydist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0D"	= "id-mod-cek-reuse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0E"	= "id-mod-cms-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0F"	= "id-mod-v1AttrCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 10"	= "id-mod-cmsalg-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 11"	= "id-mod-cms-pwri-88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 12"	= "id-mod-cms-pwri-97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 13"	= "id-mod-cms-aes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 14"	= "id-mod-cms-rsaes-oaep";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 15"	= "id-mod-msg-v3dot1";

/* S/MIME Content Types */

"06 0A 2A 86 48 86 F7 0D 01 09 10 01"		= "Typen S/MIME-inhoud";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 01"	= "id-ct-receipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 02"	= "id-ct-authData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 03"	= "id-ct-publishCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 04"	= "id-ct-TSTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 05"	= "id-ct-TDTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 06"	= "id-ct-contentInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 07"	= "id-ct-DVCSRequestData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 08"	= "id-ct-DVCSResponseData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 09"	= "id-ct-compressedData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0A"	= "id-ct-svcp-certValRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0B"	= "id-ct-svcp-certValResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0C"	= "id-ct-svcp-valPolRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0D"	= "id-ct-svcp-valPolResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0E"	= "id-ct-attrCertEncAttrs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0F"	= "id-ct-TSReq";

/* S/MIME Authenticated Attributes */

"06 0A 2A 86 48 86 F7 0D 01 09 10 02"		= "Gecontroleerde S/MIME-kenmerken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 01"	= "id-aa-receiptRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 02"	= "id-aa-securityLabel";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 03"	= "id-aa-mlExpandHistory";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 04"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 05"	= "id-aa-msgSigDigest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 06"	= "id-aa-encapContentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 07"	= "id-aa-contentIdentifier";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 08"	= "id-aa-macValue";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 09"	= "id-aa-equivalentLabels";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0A"	= "id-aa-contentReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0B"	= "id-aa-encrypKeyPref";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0C"	= "id-aa-signingCertificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0D"	= "id-aa-smimeEncryptCerts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0E"	= "id-aa-timeStampToken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0F"	= "id-aa-ets-sigPolicyId";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 10"	= "id-aa-ets-commitmentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 11"	= "id-aa-ets-signerLocation";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 12"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 13"	= "id-aa-ets-otherSigCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 14"	= "id-aa-ets-contentTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 15"	= "id-aa-ets-CertificateRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 16"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 17"	= "id-aa-ets-certValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 18"	= "id-aa-ets-revocationValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 19"	= "id-aa-ets-escTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1A"	= "id-aa-ets-certCRLTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1B"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1C"	= "id-aa-signatureType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1D"	= "id-aa-dvcs-dvc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1E"	= "id-aa-CEKReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1F"	= "id-aa-maxCEKDecrypts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 20"	= "id-aa-KEKDerivationAlg";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 21"	= "id-aa-intendedRecipients";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 22"	= "id-aa-cmc-unsignedData";

/* S/MIME Algorithms */

"06 0A 2A 86 48 86 F7 0D 01 09 10 03"		= "S/MIME-algoritmes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 01"	= "id-alg-ESDHwith3DES";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 02"	= "id-alg-ESDHwithRC2";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 03"	= "id-alg-3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 04"	= "id-alg-RC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 05"	= "id-alg-ESDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 06"	= "id-alg-CMS3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 07"	= "id-alg-CMSRC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 08"	= "id-alg-zlib";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 09"	= "id-alg-PWRI-KEK";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0A"	= "id-alg-SSDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0B"	= "id-alg-HMACwith3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0C"	= "id-alg-HMACwithAESwrap";

/* S/MIME Certificate Distribution */

"06 0A 2A 86 48 86 F7 0D 01 09 10 04"		= "S/MIME-certificaatdistributie";
"06 0B 2A 86 48 86 F7 0D 01 09 10 04 01"	= "LDAP-certificaatdistributie";

/* S/MIME Signature Policy Qualifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 05"		= "S/MIME-handtekeningbeleidskwalificatie";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 01"	= "id-spq-ets-sqt-uri";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 02"	= "id-spq-ets-sqt-unotice";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 01"	= "id-cti-ets-proofOfOrigin";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 02"	= "id-cti-ets-proofOfReceipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 03"	= "id-cti-ets-proofOfDelivery";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 04"	= "id-cti-ets-proofOfSender";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 05"	= "id-cti-ets-proofOfApproval";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 06"	= "id-cti-ets-proofOfCreation";

/* S/MIME Signature Type Identifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 09"		= "S/MIME-handtekeningtype-identificatie";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 01"	= "Handtekening aanmaker";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 02"	= "Domeinhandtekening";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 03"	= "Handtekening extra kenmerken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 04"	= "Herzieningshandtekening";

/* S/MIME Capabilities */

"06 0A 2A 86 48 86 F7 0D 01 09 10 0B"		= "S/MIME-mogelijkheden";
"06 0B 2A 86 48 86 F7 0D 01 09 10 0B 01"	= "Ingesloten binair bestand heeft voorkeur";

/* PKCS #9 for use with PKCS #12 */

"06 09 2A 86 48 86 F7 0D 01 09 14"			= "Vriendelijke naam (voor PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 15"			= "Lokale sleutelcode (voor PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 16"			= "Typen certificaten (voor PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 01"		= "X.509-certificaat (voor PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 02"		= "SDSI-certificaat (voor PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 17"			= "CRL-typen (voor PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 17 01"		= "X.509-CRL (voor PKCS-12)";

/* PKCS #12 */

"06 08 2A 86 48 86 F7 0D 01 0C"				= "PKCS-12-syntaxis voor uitwisseling van persoonlijke gegevens";
"06 09 2A 86 48 86 F7 0D 01 0C 01"			= "PKCS-12-coderingscodes op wachtwoordbasis";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 01"		= "PBE met SHA-1 en 128-bits RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 02"		= "PBE met SHA-1 en 40-bits RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 03"		= "PBE met SHA-1 en drievoudige DES-CBC met 3 sleutels";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 04"		= "PBE met SHA-1 en drievoudige DES-CBC met 2 sleutels";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 05"		= "PBE met SHA-1 en 128-bits RC2-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 06"		= "PBE met SHA-1 en 40-bits RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 0C 02"			= "PKCS-12 ESPVK-codes";
"06 0A 2A 86 48 86 F7 0D 01 0C 02 01"		= "PKCS-12 PKCS-8-sleutelverhulling";
"06 09 2A 86 48 86 F7 0D 01 0C 03"			= "PKCS-12 Bag-codes";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 01"		= "PKCS-12-sleutel-bag-codes";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 02"		= "PKCS-12-certificaat- en CRL-bag-code";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 03"		= "PKCS-12 geheime Bag-code";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 04"		= "PKCS-12 veilige inhoud-code";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 05"		= "PKCS-12 PKCS-8 verhulde-sleutel-bag-code";
"06 09 2A 86 48 86 F7 0D 01 0C 04"			= "PKCS-12-certificaat-bag-code";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 01"		= "PKCS-12 X.509-certificaat- en CRL-bag-code";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 02"		= "PKCS-12-SDSI-certificaat-bag-code";

"06 09 2A 86 48 86 F7 0D 01 0C 05"			= "PKCS-12 OID";
"06 0A 2A 86 48 86 F7 0D 01 0C 05 01"		= "PKCS-12-coderingscode op wachtwoordbasis";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 01"	= "PKCS-12 PBE met SHA-1 en 128-bits RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 02"	= "PKCS-12 PBE met SHA-1 en 40-bits RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 03"	= "PKCS-12 PBE met SHA-1 en drievoudige DES-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 04"	= "PKCS-12 PBE met SHA-1 en 128-bits RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 05"	= "PKCS-12 PBE met SHA-1 en 40-bits RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 06"	= "PKCS-12 PBE met SHA-1 en RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 07"	= "PKCS-12 PBE met SHA-1 en RC2-CBC";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 02"		= "PKCS-12 omvattende ID's";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 01"	= "PKCS-12 RSA-codering met 128-bits RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 02"	= "PKCS-12 RSA-codering met 40-bits RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 03"	= "PKCS-12 RSA-codering met drievoudige DES";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 03"		= "PKCS-12-handtekeningcode";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 03 01"	= "PKCS-12 RSA-handtekening met SHA-1-verwerking";

"06 09 2A 86 48 86 F7 0D 01 0C 0A"			= "PKCS-12 versie 1";
"06 0A 2A 86 48 86 F7 0D 01 0C 0A 01"		= "PKCS-12 Bag-codes";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 01"	= "PKCS-12-sleutelbag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 02"	= "PKCS-12 PKCS-8 verhulde-sleutelbag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 03"	= "PKCS-12-certificaatbag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 04"	= "PKCS-12-CRL-bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 05"	= "PKCS-12 geheime bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 06"	= "PKCS-12 veilige-inhoudbag";

/* PKCS #15 */

"06 09 2A 86 48 86 F7 0D 01 0F 01"		= "PKCS-15-modules";
"06 09 2A 86 48 86 F7 0D 01 0F 02"		= "PKCS-15-kenmerken";
"06 09 2A 86 48 86 F7 0D 01 0F 03"		= "PKCS-15-inhoudstype";
"06 0A 2A 86 48 86 F7 0D 01 0F 03 01"	= "PKCS-15-inhoud";

/* RSADSI digest algorithms */

"06 08 2A 86 48 86 F7 0D 02"			= "RSADSI-verwerkingsalgoritme";
"06 08 2A 86 48 86 F7 0D 02 02"			= "MD2";
"06 08 2A 86 48 86 F7 0D 02 04"			= "MD4";
"06 08 2A 86 48 86 F7 0D 02 05"			= "MD5";
"06 08 2A 86 48 86 F7 0D 02 07"			= "HMAC met SHA-1";

/* RSADSI encryption algorithms */

"06 08 2A 86 48 86 F7 0D 03"			= "RSADSI-coderingsalgoritme";
"06 08 2A 86 48 86 F7 0D 03 02"			= "RC2-CBC";
"06 08 2A 86 48 86 F7 0D 03 03"			= "RC2-ECB";
"06 08 2A 86 48 86 F7 0D 03 04"			= "RC4";
"06 08 2A 86 48 86 F7 0D 03 05"			= "RC4 met MAC";
"06 08 2A 86 48 86 F7 0D 03 06"			= "DESX-CBC";
"06 08 2A 86 48 86 F7 0D 03 07"			= "DES-EDE3-CBC";
"06 08 2A 86 48 86 F7 0D 03 08"			= "RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 09"			= "RC5-CBC Pad";
"06 08 2A 86 48 86 F7 0D 03 0A"			= "DES-CDMF";

/* Identrus */

"06 09 2A 86 48 86 FA 65 01 06 01"		= "Identificatie onbekend Identrus-beleid";
"06 08 2A 86 48 86 FA 65 04 01"			= "Identrus OCSP";

/* Ascom Systech */

"06 0A 2B 06 01 04 01 81 3C 07 01 01"		= "Ascom";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 01"	= "IDEA-ECB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 02"	= "IDEA-CBC";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 03"	= "IDEA-CFB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 04"	= "IDEA-OFB";

/* MIT */

"06 09 2A 86 48 86 F7 12 01 02 02"			= "MIT Kerberos V5";
"06 0A 2A 86 48 86 F7 12 01 02 02 03"		= "MIT gebruiker-naar-gebruiker Kerberos";

/* Microsoft */

"06 09 2A 86 48 82 F7 12 01 02 02"			= "Microsoft Kerberos";

"06 08 2A 86 48 86 F7 14 01 03"				= "Microsoft Exchange Server-objectklasse";
"06 09 2A 86 48 86 F7 14 01 03 00"			= "Siteadressering";
"06 09 2A 86 48 86 F7 14 01 03 0D"			= "Klassenschema";
"06 09 2A 86 48 86 F7 14 01 03 0E"			= "Kenmerkenschema";
"06 09 2A 86 48 86 F7 14 01 03 11"			= "Mailbox-Agent";
"06 09 2A 86 48 86 F7 14 01 03 16"			= "Postbus";
"06 09 2A 86 48 86 F7 14 01 03 17"			= "Container";
"06 09 2A 86 48 86 F7 14 01 03 2E"			= "Mailontvanger";
"06 09 2A 86 48 86 F7 14 01 02 81 71"		= "Leveringsmechanisme";

"06 07 2A 86 48 86 F7 14 04"				= "Microsoft-bestandsstructuren";
"06 08 2A 86 48 86 F7 14 04 02"				= "Microsoft Word";
"06 08 2A 86 48 86 F7 14 04 03"				= "Microsoft Excel";
"06 08 2A 86 48 86 F7 14 04 04"				= "Microsoft Project";
"06 08 2A 86 48 86 F7 14 04 05"				= "Microsoft PowerPoint";
"06 08 2A 86 48 86 F7 14 04 06"				= "Microsoft Works";

"06 08 2B 06 01 04 01 82 37 02"				= "Authenticode";
"06 0A 2B 06 01 04 01 82 37 02 01 04"		= "Context indirecte SPC-gegevens";
"06 0A 2B 06 01 04 01 82 37 02 01 0A"		= "SPC-agentschapinfo";
"06 0A 2B 06 01 04 01 82 37 02 01 0B"		= "Type SPC-verklaring";
"06 0A 2B 06 01 04 01 82 37 02 01 0C"		= "SPC Opus-info";
"06 0A 2B 06 01 04 01 82 37 02 01 0E"		= "SPC-certificaatuitbreidingen";
"06 0A 2B 06 01 04 01 82 37 02 01 0F"		= "SPC PE-afbeeldingsgegevens";
"06 0A 2B 06 01 04 01 82 37 02 01 14"		= "SPC-koppeling (type 1)";
"06 0A 2B 06 01 04 01 82 37 02 01 15"		= "Individuele codeondertekening";
"06 0A 2B 06 01 04 01 82 37 02 01 16"		= "Commerciële codeondertekening";
"06 0A 2B 06 01 04 01 82 37 02 01 19"		= "SPC-koppeling (type 2)";
"06 0A 2B 06 01 04 01 82 37 02 01 1A"		= "Minimale SPC-criteria";
"06 0A 2B 06 01 04 01 82 37 02 01 1B"		= "Financiële SPC-criteria";
"06 0A 2B 06 01 04 01 82 37 02 01 1C"		= "SPC-koppeling (type 3)";

"06 0A 2B 06 01 04 01 82 37 02 02 0A"		= "Aanbieder NTLM-beveiligingsondersteuning";
"06 0A 2B 06 01 04 01 82 37 03 02 01"		= "Controlehandtekening tijdstempel";

"06 09 2B 06 01 04 01 82 37 0A 01"			= "Certificaatvertrouwenslijst";
"06 0A 2B 06 01 04 01 82 37 0A 01 01"		= "Gesorteerde CTL-uitbreiding";
"06 09 2B 06 01 04 01 82 37 0A 02"			= "Volgende bijwerklocatie";

"06 09 2B 06 01 04 01 82 37 0A 03"			= "Uitgebreid sleutelgebruik";
"06 0A 2B 06 01 04 01 82 37 0A 03 01"		= "Ondertekening certificaatvertrouwenslijst";
"06 0A 2B 06 01 04 01 82 37 0A 03 02"		= "Ondertekening tijdstempel";
"06 0A 2B 06 01 04 01 82 37 0A 03 03"		= "Server Gated Crypto";
"06 0B 2B 06 01 04 01 82 37 0A 03 03 01"	= "Seriële codering";
"06 0A 2B 06 01 04 01 82 37 0A 03 04"		= "Gecodeerde bestandssystemen";
"06 0B 2B 06 01 04 01 82 37 0A 03 04 01"	= "Herstel gecodeerde bestandssystemen";
"06 0A 2B 06 01 04 01 82 37 0A 03 05"		= "Compatibel met Windows-hardware";
"06 0A 2B 06 01 04 01 82 37 0A 03 06"		= "NT5-ondertekening";
"06 0A 2B 06 01 04 01 82 37 0A 03 07"		= "Windows-hardware-OEM-ondertekening";
"06 0A 2B 06 01 04 01 82 37 0A 03 08"		= "Ingebedde NT-ondertekening";
"06 0A 2B 06 01 04 01 82 37 0A 03 09"		= "Ondertekening lijst met vertrouwde root";
"06 0A 2B 06 01 04 01 82 37 0A 03 0A"		= "Gekwalificeerde ondergeschiktheid";
"06 0A 2B 06 01 04 01 82 37 0A 03 0B"		= "Sleutelherstel";
"06 0A 2B 06 01 04 01 82 37 0A 03 0C"		= "Documentondertekening";

"06 09 2B 06 01 04 01 82 37 0A 04"			= "Kenmerkobjectidentificaties";
"06 0A 2B 06 01 04 01 82 37 0A 04 01"		= "Ja/Nee-vertrouwenskenmerk";
"06 0A 2B 06 01 04 01 82 37 0A 05 01"		= "Microsoft-muziek-DRM";
"06 0A 2B 06 01 04 01 82 37 0A 05 02"		= "Microsoft DRM-individualisering";
"06 0A 2B 06 01 04 01 82 37 0A 06 01"		= "Microsoft-licenties";
"06 0A 2B 06 01 04 01 82 37 0A 06 02"		= "Microsoft-licentieserver";

"06 08 2B 06 01 04 01 82 37 0D"				= "Microsoft PKCS-10-objectidentificaties";
"06 09 2B 06 01 04 01 82 37 0D 01"			= "Vernieuwingscertificaat";
"06 0A 2B 06 01 04 01 82 37 0D 02 01"		= "Inschrijvingsnaam/waardepaar";
"06 0A 2B 06 01 04 01 82 37 0D 02 02"		= "Inschrijvings-CSP";
"06 0A 2B 06 01 04 01 82 37 0D 02 03"		= "OS-versie";
"06 08 2B 06 01 04 01 82 37 0F"				= "Microsoft Java";
"06 08 2B 06 01 04 01 82 37 10"				= "Microsoft Outlook/Exchange";
"06 09 2B 06 01 04 01 82 37 10 04"			= "Microsoft Outlook Express";
"06 08 2B 06 01 04 01 82 37 11"				= "Microsoft PKCS-12-kenmerken";
"06 09 2B 06 01 04 01 82 37 11 01"			= "Sleutelset lokale computer";

"06 08 2B 06 01 04 01 82 37 14"				= "Microsoft Enrollment-infrastructuur";
"06 09 2B 06 01 04 01 82 37 14 01"			= "Auto-Enroll CTL-gebruik";
"06 09 2B 06 01 04 01 82 37 14 02"			= "Type inschrijvingscertificaat";
"06 0A 2B 06 01 04 01 82 37 14 02 01"		= "Inschrijvingsagent";
"06 0A 2B 06 01 04 01 82 37 14 02 02"		= "Smartcard-aanmelding";
"06 0A 2B 06 01 04 01 82 37 14 02 03"		= "Primaire NT-naam";

"06 08 2B 06 01 04 01 82 37 15"				= "Microsoft-certificaatserverinfrastructuur";
"06 09 2B 06 01 04 01 82 37 15 01"			= "Microsoft CA-vernieuwingsversie";
"06 08 2B 06 01 04 01 82 37 58"				= "CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 01"			= "CAPICOM-versie";
"06 09 2B 06 01 04 01 82 37 58 02"			= "CAPICOM-kenmerk";
"06 0A 2B 06 01 04 01 82 37 58 02 01"		= "Documentnaam";
"06 0A 2B 06 01 04 01 82 37 58 02 02"		= "Documentbeschrijving";
"06 09 2B 06 01 04 01 82 37 58 03"			= "Gecodeerde gegevens";
"06 0A 2B 06 01 04 01 82 37 58 03 01"		= "Gecodeerde inhoud";

/* UNINETT */

"06 0A 2B 06 01 04 01 92 7C 0A 01 01"		= "UNINETT-beleidsidentificatie";

/* ICE-TEL */

"06 08 2B 06 01 04 01 95 18 0A"				= "ICE-TEL-beleidsidentificatie";
"06 0A 2B 06 01 04 01 95 62 01 01 01"		= "ICE-TEL CA-beleidsidentificatie";

/* cryptlib */

"06 0A 2B 06 01 04 01 97 55 01 01 01"		= "Blowfish-ECB";
"06 0A 2B 06 01 04 01 97 55 01 01 02"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 03"		= "Blowfish-CFB";
"06 0A 2B 06 01 04 01 97 55 01 01 04"		= "Blowfish-OFB";
"06 0A 2B 06 01 04 01 97 55 01 02 01"		= "ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 01"	= "ElGamal met SHA-1";
"06 0B 2B 06 01 04 01 97 55 01 02 01 02"	= "ElGamal met RIPEMD-160";
"06 09 2B 06 01 04 01 97 55 03 01"			= "cryptlib-kenmerken";
"06 0A 2B 06 01 04 01 97 55 03 01 01"		= "cryptlib-aanwezigheidscontrole";
"06 0A 2B 06 01 04 01 97 55 03 01 02"		= "OCSP-antwoord-RTCS";
"06 0A 2B 06 01 04 01 97 55 03 01 03"		= "OCSP-antwoord-RTCS uitgebreid";
"06 0A 2B 06 01 04 01 97 55 03 01 04"		= "Uitgebreide CRL-reden";
"06 0A 2B 06 01 04 01 97 55 03 01 05"		= "Sleutelfuncties";
"06 0A 2B 06 01 04 01 97 55 03 01 06"		= "PKI-opstarten";
"06 09 2B 06 01 04 01 97 55 04 01"			= "cryptlib-inhoud";
"06 0A 2B 06 01 04 01 97 55 04 01 01"		= "cryptlib-configuratiegegevens";
"06 0A 2B 06 01 04 01 97 55 04 01 02"		= "cryptlib-gebruikersindex";
"06 0A 2B 06 01 04 01 97 55 04 01 03"		= "cryptlib-gebruikersinfo";
"06 0B 2B 06 01 04 01 97 55 2A D7 24 01"	= "MPEG-1";
"06 0C 2B 06 01 04 01 97 55 58 59 5A 5A 59"	= "XYZZY-beleidsidentificatie";

/* Timeproof (www.timeproof.de) */

"06 07 2B 06 01 04 01 AA 60"		= "Tijdbestendig";
"06 08 2B 06 01 04 01 AA 60 01"		= "Tijdhandtekeningsysteem";
"06 09 2B 06 01 04 01 AA 60 01 01"	= "Tijdhandtekeningsysteem 80";
"06 09 2B 06 01 04 01 AA 60 01 02"	= "Tijdhandtekeningsysteem 380";
"06 09 2B 06 01 04 01 AA 60 01 03"	= "Tijdhandtekeningsysteem 400";

/* MEDePass */

"06 09 2B 06 01 04 01 AD 0A 00 03"  = "Secundaire uitvoeringen";
"06 09 2B 06 01 04 01 AD 0A 00 04"  = "Artsidentificaties";

/* Kerberos */

"06 05 2B 06 01 05 02"              = "Kerberos v5";
"06 06 2B 06 01 05 02 03"           = "Kerberos PKINIT";
"06 07 2B 06 01 05 02 03 01"        = "Kerberos-identificatiegegevens";
"06 07 2B 06 01 05 02 03 02"        = "Kerberos Diffie-Hellman-sleutelgegevens";
"06 07 2B 06 01 05 02 03 03"        = "Kerberos-antwoordsleutelgegevens";
"06 07 2B 06 01 05 02 03 04"        = "Kerberos-clientidentiteitscontrole";
"06 07 2B 06 01 05 02 03 05"        = "Kerberos Key Distribution Center (KDC)";

/* IANA */

"06 06 2B 06 01 05 05 01"			= "SPKM (Simple Public Key Mechanism)";
"06 06 2B 06 01 05 05 02"			= "SPNEGO";

/* PKIX */

"06 06 2B 06 01 05 05 07"			= "Infrastructuur publieke sleutel";

"06 07 2B 06 01 05 05 07 01"		= "Private PKIX-certificaatuitbreiding";
"06 08 2B 06 01 05 05 07 01 01"		= "Informatietoegang certificaatautoriteit";
"06 08 2B 06 01 05 05 07 01 02"		= "Biometrische gegevens";
"06 08 2B 06 01 05 05 07 01 03"		= "Gekwalificeerde certificaatverklaringen";
"06 08 2B 06 01 05 05 07 01 04"		= "Auditidentiteit kenmerkcertificaat";
"06 08 2B 06 01 05 05 07 01 05"		= "Kenmerkcertificaatbestemming";
"06 08 2B 06 01 05 05 07 01 06"		= "Regelaars autoriteit kenmerkcertificaat";
"06 08 2B 06 01 05 05 07 01 07"		= "SBGP-IP-adresblokkering";
"06 08 2B 06 01 05 05 07 01 08"		= "Autonome SBGP-systeemidentificatie";
"06 08 2B 06 01 05 05 07 01 09"		= "SBGP-routeridentificatie";
"06 08 2B 06 01 05 05 07 01 0A"		= "Kenmerkcertificaatproxying";
"06 08 2B 06 01 05 05 07 01 0B"		= "Toegang tot onderwerpinformatie";
"06 08 2B 06 01 05 05 07 01 0C"		= "Logo";

"06 07 2B 06 01 05 05 07 02"		= "Typen beleidskwalificatie";
"06 08 2B 06 01 05 05 07 02 01"		= "Verklaring certificeringsuitvoering";
"06 08 2B 06 01 05 05 07 02 02"		= "Melding gebruiker";
"06 08 2B 06 01 05 05 07 02 03"		= "Tekstmelding";

"06 07 2B 06 01 05 05 07 03"		= "Doel sleutel";
"06 08 2B 06 01 05 05 07 03 01"		= "Serveridentiteitscontrole";
"06 08 2B 06 01 05 05 07 03 02"		= "Clientidentiteitscontrole";
"06 08 2B 06 01 05 05 07 03 03"		= "Codeondertekening";
"06 08 2B 06 01 05 05 07 03 04"		= "E-mailbeveiliging";
"06 08 2B 06 01 05 05 07 03 05"		= "IPSEC-eindsysteem";
"06 08 2B 06 01 05 05 07 03 06"		= "IPSEC-tunnel";
"06 08 2B 06 01 05 05 07 03 07"		= "IPSEC-gebruiker";
"06 08 2B 06 01 05 05 07 03 08"		= "Tijdstempel";
"06 08 2B 06 01 05 05 07 03 09"		= "OCSP-ondertekening";
"06 08 2B 06 01 05 05 07 03 0A"		= "DVCS";
"06 08 2B 06 01 05 05 07 03 0B"		= "SBGP AA-serveridentiteitscontrole";

"06 07 2B 06 01 05 05 07 04"		= "CMP-informatietypen";
"06 08 2B 06 01 05 05 07 04 01"		= "CA-protocolcoderingscertificaat";
"06 08 2B 06 01 05 05 07 04 02"		= "Typen ondertekeningssleutelparen";
"06 08 2B 06 01 05 05 07 04 03"		= "Typen coderingssleutelparen";
"06 08 2B 06 01 05 05 07 04 04"		= "Symmetrisch algoritme (voorkeur)";
"06 08 2B 06 01 05 05 07 04 05"		= "CA-sleutelupdate-info";
"06 08 2B 06 01 05 05 07 04 06"		= "Huidige CRL";
"06 08 2B 06 01 05 05 07 04 07"		= "Niet-ondersteunde OID's";
"06 08 2B 06 01 05 05 07 04 08"		= "Abonnementsverzoek";
"06 08 2B 06 01 05 05 07 04 09"		= "Abonnementsantwoord";
"06 08 2B 06 01 05 05 07 04 0A"		= "Verzoek parameter sleutelpaar";
"06 08 2B 06 01 05 05 07 04 0B"		= "Antwoord parameter sleutelpaar";
/* %%% need to expand these labels, but can't find them documented anywhere online! */
"06 08 2B 06 01 05 05 07 04 0C"		= "revPassphrase";
"06 08 2B 06 01 05 05 07 04 0D"		= "implicitConfirm";
"06 08 2B 06 01 05 05 07 04 0E"		= "confirmWaitTime";
"06 08 2B 06 01 05 05 07 04 0F"		= "origPKIMessage";
"06 08 2B 06 01 05 05 07 04 10"		= "suppLangTags";

"06 07 2B 06 01 05 05 07 05"		= "CRMF-registratie";
"06 08 2B 06 01 05 05 07 05 01"		= "Registratieregeling";
"06 09 2B 06 01 05 05 07 05 01 01"	= "Registratieteken";
"06 09 2B 06 01 05 05 07 05 01 02"	= "Identiteitscontroleur";
"06 09 2B 06 01 05 05 07 05 01 03"	= "PKI-publicatie-info";
"06 09 2B 06 01 05 05 07 05 01 04"	= "PKI-archiefopties";
"06 09 2B 06 01 05 05 07 05 01 05"	= "Oude certificaatcode";
"06 09 2B 06 01 05 05 07 05 01 06"	= "Protocolcoderingssleutel";
"06 09 2B 06 01 05 05 07 05 01 07"	= "Alternatief certificaatsjabloon";
"06 09 2B 06 01 05 05 07 05 01 08"	= "WAP WTLS-sjabloon";

"06 08 2B 06 01 05 05 07 05 02"		= "CRMF-registratie-info";
"06 09 2B 06 01 05 05 07 05 02 01"	= "UTF-8-paren";
"06 09 2B 06 01 05 05 07 05 02 02"	= "Certificaataanvraag";

"06 07 2B 06 01 05 05 07 06"		= "Algoritmes";
"06 08 2B 06 01 05 05 07 06 01"		= "DES-40";
"06 08 2B 06 01 05 05 07 06 02"		= "Geen handtekening";
"06 08 2B 06 01 05 05 07 06 03"		= "dh-sig-hmac-sha1";
"06 08 2B 06 01 05 05 07 06 04"		= "dh-pop";

"06 07 2B 06 01 05 05 07 07"		= "CMC-regelaars";

"06 07 2B 06 01 05 05 07 08"		= "Naam anders";
"06 08 2B 06 01 05 05 07 08 01"		= "Persoonlijke gegevens";
"06 08 2B 06 01 05 05 07 08 02"		= "Gebruikersgroep";

"06 07 2B 06 01 05 05 07 09"		= "Persoonlijke gegevens";
"06 08 2B 06 01 05 05 07 09 01"		= "Geboortedatum";
"06 08 2B 06 01 05 05 07 09 02"		= "Geboorteplaats";
"06 08 2B 06 01 05 05 07 09 03"		= "Pseudoniem";
"06 08 2B 06 01 05 05 07 09 04"		= "Geslacht";
"06 08 2B 06 01 05 05 07 09 05"		= "Nationaliteit";
"06 08 2B 06 01 05 05 07 09 06"		= "Land van verblijf";

"06 07 2B 06 01 05 05 07 0A"		= "Kenmerkcertificaat";
"06 08 2B 06 01 05 05 07 0A 01"		= "Identiteitscontrolegegevens";
"06 08 2B 06 01 05 05 07 0A 02"		= "Toegangsidentiteit";
"06 08 2B 06 01 05 05 07 0A 03"		= "Belastingidentiteit";
"06 08 2B 06 01 05 05 07 0A 04"		= "Groepeer";
"06 08 2B 06 01 05 05 07 0A 05"		= "Functie";
"06 08 2B 06 01 05 05 07 0A 06"		= "WLAN SSID";

/* OCSP */

"06 08 2B 06 01 05 05 07 30 01"		= "Onlinecertificaatstatusprotocol";
"06 09 2B 06 01 05 05 07 30 01 01"	= "OCSP-basisantwoord";
"06 09 2B 06 01 05 05 07 30 01 02"	= "OCSP Nonce-uitbreiding";
"06 09 2B 06 01 05 05 07 30 01 03"	= "OCSP CRL-verwijzing";
"06 09 2B 06 01 05 05 07 30 01 04"	= "OCSP-antwoord";
"06 09 2B 06 01 05 05 07 30 01 05"	= "OCSP-niet-intrekkingscontrole";
"06 09 2B 06 01 05 05 07 30 01 06"	= "OCSP-archiefgrens";
"06 09 2B 06 01 05 05 07 30 01 07"	= "OCSP-voorzieningsbepaler";

"06 08 2B 06 01 05 05 07 30 02"		= "CA-verstrekkers";
"06 08 2B 06 01 05 05 07 30 03"		= "Tijdstempel";

/* ISAKMP */

"06 08 2B 06 01 05 05 08 01 01"		= "HMAC MD5";
"06 08 2B 06 01 05 05 08 01 02"		= "HMAC SHA-1";
"06 08 2B 06 01 05 05 08 01 03"		= "HMAC Tiger";
"06 08 2B 06 01 05 05 08 02 02"		= "IKE Intermediate";

/* DEC (via ECMA) */

"06 07 2B 0C 02 87 73 07 01"		= "DEC-coderingsalgoritme";
"06 08 2B 0C 02 87 73 07 01 02"		= "DEC DEA";
"06 07 2B 0C 02 87 73 07 02"		= "DEC Hash-algoritme";
"06 07 2B 0C 02 87 73 07 02 01"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 02 02"		= "DEC MD4";
"06 07 2B 0C 02 87 73 07 03"		= "DEC-handtekeningalgoritme";
"06 07 2B 0C 02 87 73 07 03 01"		= "DEC MD2 met RSA";
"06 07 2B 0C 02 87 73 07 03 02"		= "DEC MD4 met RSA";
"06 07 2B 0C 02 87 73 07 03 03"		= "DEC DEA-MAC";

/* NIST Open Systems Environment (OSE) Implementor's Workshop (OIW) */

"06 05 2B 0E 02 1A 05"				= "SHA";
"06 06 2B 0E 03 02 01 01"			= "RSA";
"06 05 2B 0E 03 02 02"				= "MD4 met RSA";
"06 05 2B 0E 03 02 03"				= "MD5 met RSA";
"06 05 2B 0E 03 02 04"				= "MD4 met RSA-codering";
"06 06 2B 0E 03 02 02 01"			= "SqMod-N";
"06 06 2B 0E 03 02 03 01"			= "SqMod-N met RSA";
"06 05 2B 0E 03 02 06"				= "DES-ECB";
"06 05 2B 0E 03 02 07"				= "DES-CBC";
"06 05 2B 0E 03 02 08"				= "DES-OFB";
"06 05 2B 0E 03 02 09"				= "DES-CFB";
"06 05 2B 0E 03 02 0A"				= "DES-MAC";
"06 05 2B 0E 03 02 0B"				= "RSA-handtekening";
"06 05 2B 0E 03 02 0C"				= "DSA";
"06 05 2B 0E 03 02 0D"				= "DSA met SHA";
"06 05 2B 0E 03 02 0E"				= "MDC2 met RSA-handtekening";
"06 05 2B 0E 03 02 0F"				= "SHA met RSA-handtekening";
"06 05 2B 0E 03 02 10"				= "Diffie-Hellman met Common Modulus";
"06 05 2B 0E 03 02 11"				= "DES-EDE";
"06 05 2B 0E 03 02 12"				= "SHA";
"06 05 2B 0E 03 02 13"				= "MDC-2";
"06 05 2B 0E 03 02 14"				= "DSA Common";
"06 05 2B 0E 03 02 15"				= "DSA Common met SHA";
"06 05 2B 0E 03 02 16"				= "RSA-sleuteltransport";
"06 05 2B 0E 03 02 17"				= "Keyed-hash-seal";
"06 05 2B 0E 03 02 18"				= "MD2 met RSA-handtekening";
"06 05 2B 0E 03 02 19"				= "MD5 met RSA-handtekening";
"06 05 2B 0E 03 02 1A"				= "SHA-1";
"06 05 2B 0E 03 02 1B"				= "DSA met SHA-1";
"06 05 2B 0E 03 02 1C"				= "DSA met Common SHA-1";
"06 05 2B 0E 03 02 1D"				= "SHA-1 met RSA-codering";
"06 05 2B 0E 03 03 01"				= "Simple-strong-auth-mechanism";
"06 06 2B 0E 07 02 01 01"			= "ElGamal";
"06 06 2B 0E 07 02 03 01"			= "MD2 met RSA";
"06 06 2B 0E 07 02 03 02"			= "MD2 met ElGamal";

/* Teletrust */

"06 03 2B 24 01"					= "Document";
"06 04 2B 24 01 01"					= "Definitieve versie";
"06 04 2B 24 01 02"					= "Concept";
"06 03 2B 24 02"					= "SIO";
"06 04 2B 24 02 01"					= "SEDU";

"06 03 2B 24 03"					= "Algoritme";
"06 04 2B 24 03 01"					= "Coderingsalgoritme";
"06 05 2B 24 03 01 01"				= "DES";
"06 06 2B 24 03 01 01 01"			= "DES-ECB Pad";
"06 07 2B 24 03 01 01 01 01"		= "DES-ECB ISO Pad";
"06 07 2B 24 03 01 01 02 01"		= "DES-CBC Pad";
"06 08 2B 24 03 01 01 02 01 01"		= "DES-CBC ISO Pad";
"06 05 2B 24 03 01 03"				= "DES3";
"06 07 2B 24 03 01 03 01 01"		= "DES3-ECB Pad";
"06 08 2B 24 03 01 03 01 01 01"		= "DES3-ECB ISO Pad";
"06 07 2B 24 03 01 03 02 01"		= "DES3-CBC Pad";
"06 08 2B 24 03 01 03 02 01 01"		= "DES3-CBC ISO Pad";
"06 05 2B 24 03 01 02"				= "IDEA";
"06 06 2B 24 03 01 02 01"			= "IDEA-ECB";
"06 07 2B 24 03 01 02 01 01"		= "IDEA-ECB Pad";
"06 08 2B 24 03 01 02 01 01 01"		= "IDEA-ECB ISO Pad";
"06 06 2B 24 03 01 02 02"			= "IDEA-CBC";
"06 07 2B 24 03 01 02 02 01"		= "IDEA-CBC Pad";
"06 08 2B 24 03 01 02 02 01 01"		= "IDEA-CBC ISO Pad";
"06 06 2B 24 03 01 02 03"			= "IDEA-OFB";
"06 06 2B 24 03 01 02 04"			= "IDEA-CFB";
"06 05 2B 24 03 01 04"				= "RSA-codering";
"06 05 2B 24 03 01 05"				= "BSI-1";
"06 06 2B 24 03 01 05 01"			= "BSI-1-ECB Pad";
"06 06 2B 24 03 01 05 02"			= "BSI-1-CBC Pad";
"06 07 2B 24 03 01 05 02 01"		= "BSI-1-CBC PEM Pad";

"06 04 2B 24 03 02"					= "Hash-algoritme";
"06 05 2B 24 03 02 01"				= "RIPEMD-160";
"06 05 2B 24 03 02 02"				= "RIPEMD-128";
"06 05 2B 24 03 02 03"				= "RIPEMD-256";
"06 05 2B 24 03 02 04"				= "MDC2 Single Length";
"06 05 2B 24 03 02 05"				= "MDC2 Double Length";
"06 04 2B 24 03 03"					= "Handtekeningalgoritme";
"06 05 2B 24 03 03 01"				= "RSA-handtekening";

"06 06 2B 24 03 03 01 01"			= "RSA-handtekening met SHA-1";
"06 09 2B 24 03 03 01 01 84 00 02"	= "RSA-handtekening met SHA-1 512/L2";
"06 09 2B 24 03 03 01 01 85 00 02"	= "RSA-handtekening met SHA-1 640/L2";
"06 09 2B 24 03 03 01 01 86 00 02"	= "RSA-handtekening met SHA-1 768/L2";
"06 09 2B 24 03 03 01 01 87 00 02"	= "RSA-handtekening met SHA-1 896/L2";
"06 09 2B 24 03 03 01 01 88 00 02"	= "RSA-handtekening met SHA-1 1024/L2";
"06 09 2B 24 03 03 01 01 84 00 03"	= "RSA-handtekening met SHA-1 512/L3";
"06 09 2B 24 03 03 01 01 85 00 03"	= "RSA-handtekening met SHA-1 640/L3";
"06 09 2B 24 03 03 01 01 86 00 03"	= "RSA-handtekening met SHA-1 768/L3";
"06 09 2B 24 03 03 01 01 87 00 03"	= "RSA-handtekening met SHA-1 896/L3";
"06 09 2B 24 03 03 01 01 88 00 03"	= "RSA-handtekening met SHA-1 1024/L3";
"06 09 2B 24 03 03 01 01 84 00 05"	= "RSA-handtekening met SHA-1 512/L5";
"06 09 2B 24 03 03 01 01 85 00 05"	= "RSA-handtekening met SHA-1 640/L5";
"06 09 2B 24 03 03 01 01 86 00 05"	= "RSA-handtekening met SHA-1 768/L5";
"06 09 2B 24 03 03 01 01 87 00 05"	= "RSA-handtekening met SHA-1 896/L5";
"06 09 2B 24 03 03 01 01 88 00 05"	= "RSA-handtekening met SHA-1 1024/L5";
"06 09 2B 24 03 03 01 01 84 00 09"	= "RSA-handtekening met SHA-1 512/L9";
"06 09 2B 24 03 03 01 01 85 00 09"	= "RSA-handtekening met SHA-1 640/L9";
"06 09 2B 24 03 03 01 01 86 00 09"	= "RSA-handtekening met SHA-1 768/L9";
"06 09 2B 24 03 03 01 01 87 00 09"	= "RSA-handtekening met SHA-1 896/L9";
"06 09 2B 24 03 03 01 01 88 00 09"	= "RSA-handtekening met SHA-1 1024/L9";
"06 09 2B 24 03 03 01 01 84 00 11"	= "RSA-handtekening met SHA-1 512/L11";
"06 09 2B 24 03 03 01 01 85 00 11"	= "RSA-handtekening met SHA-1 640/L11";
"06 09 2B 24 03 03 01 01 86 00 11"	= "RSA-handtekening met SHA-1 768/L11";
"06 09 2B 24 03 03 01 01 87 00 11"	= "RSA-handtekening met SHA-1 896/L11";
"06 09 2B 24 03 03 01 01 88 00 11"	= "RSA-handtekening met SHA-1 1024/L11";

"06 06 2B 24 03 03 01 02"			= "RSA-handtekening met RIPEMD-160";
"06 09 2B 24 03 03 01 02 84 00 02"	= "RSA-handtekening met RIPEMD-160 512/L2";
"06 09 2B 24 03 03 01 02 85 00 02"	= "RSA-handtekening met RIPEMD-160 640/L2";
"06 09 2B 24 03 03 01 02 86 00 02"	= "RSA-handtekening met RIPEMD-160 768/L2";
"06 09 2B 24 03 03 01 02 87 00 02"	= "RSA-handtekening met RIPEMD-160 896/L2";
"06 09 2B 24 03 03 01 02 88 00 02"	= "RSA-handtekening met RIPEMD-160 1024/L2";
"06 09 2B 24 03 03 01 02 84 00 03"	= "RSA-handtekening met RIPEMD-160 512/L3";
"06 09 2B 24 03 03 01 02 85 00 03"	= "RSA-handtekening met RIPEMD-160 640/L3";
"06 09 2B 24 03 03 01 02 86 00 03"	= "RSA-handtekening met RIPEMD-160 768/L3";
"06 09 2B 24 03 03 01 02 87 00 03"	= "RSA-handtekening met RIPEMD-160 896/L3";
"06 09 2B 24 03 03 01 02 88 00 03"	= "RSA-handtekening met RIPEMD-160 1024/L3";
"06 09 2B 24 03 03 01 02 84 00 05"	= "RSA-handtekening met RIPEMD-160 512/L5";
"06 09 2B 24 03 03 01 02 85 00 05"	= "RSA-handtekening met RIPEMD-160 640/L5";
"06 09 2B 24 03 03 01 02 86 00 05"	= "RSA-handtekening met RIPEMD-160 768/L5";
"06 09 2B 24 03 03 01 02 87 00 05"	= "RSA-handtekening met RIPEMD-160 896/L5";
"06 09 2B 24 03 03 01 02 88 00 05"	= "RSA-handtekening met RIPEMD-160 1024/L5";
"06 09 2B 24 03 03 01 02 84 00 09"	= "RSA-handtekening met RIPEMD-160 512/L9";
"06 09 2B 24 03 03 01 02 85 00 09"	= "RSA-handtekening met RIPEMD-160 640/L9";
"06 09 2B 24 03 03 01 02 86 00 09"	= "RSA-handtekening met RIPEMD-160 768/L9";
"06 09 2B 24 03 03 01 02 87 00 09"	= "RSA-handtekening met RIPEMD-160 896/L9";
"06 09 2B 24 03 03 01 02 88 00 09"	= "RSA-handtekening met RIPEMD-160 1024/L9";
"06 09 2B 24 03 03 01 02 84 00 11"	= "RSA-handtekening met RIPEMD-160 512/L11";
"06 09 2B 24 03 03 01 02 85 00 11"	= "RSA-handtekening met RIPEMD-160 640/L11";
"06 09 2B 24 03 03 01 02 86 00 11"	= "RSA-handtekening met RIPEMD-160 768/L11";
"06 09 2B 24 03 03 01 02 87 00 11"	= "RSA-handtekening met RIPEMD-160 896/L11";
"06 09 2B 24 03 03 01 02 88 00 11"	= "RSA-handtekening met RIPEMD-160 1024/L11";

"06 06 2B 24 03 03 01 03"			= "RSA-handtekening met RIPEMD-128";
"06 06 2B 24 03 03 01 04"			= "RSA-handtekening met RIPEMD-256";

"06 05 2B 24 03 03 02"				= "ECSIE-handtekening";
"06 06 2B 24 03 03 02 01"			= "ECSIE-handtekening met SHA-1";
"06 06 2B 24 03 03 02 02"			= "ECSIE-handtekening met RIPEMD-160";
"06 06 2B 24 03 03 02 03"			= "ECSIE-handtekening met MD2";
"06 06 2B 24 03 03 02 04"			= "ECSIE-handtekening met MD5";

"06 04 2B 24 03 04"					= "Handtekeningsschema";
"06 05 2B 24 03 04 01"				= "ISO9796-1";
"06 05 2B 24 03 04 02"				= "ISO9796-2";
"06 05 2B 24 03 04 02 01"			= "ISO9796-2 met RED";
"06 06 2B 24 03 04 02 02"			= "ISO9796-2 met RSA";
"06 06 2B 24 03 04 02 03"			= "ISO9796-2 met RND";

"06 03 2B 24 04"					= "Kenmerk";
"06 03 2B 24 05"					= "Beleid";
"06 03 2B 24 06"					= "API";
"06 04 2B 24 06 01"					= "Fabrikantspecifieke API";
"06 05 2B 24 06 01 01"				= "UTIMACO-API";
"06 04 2B 24 06 02"					= "Functionaliteitsspecifieke API";
"06 03 2B 24 07"					= "Sleutelbeheer";
"06 04 2B 24 07 01"					= "Sleutelovereenkomst";
"06 05 2B 24 07 01 01"				= "BSI PKE";
"06 04 2B 24 07 02"					= "Sleuteloverdracht";
"06 05 2B 24 07 02 01"				= "ISO9796-2 met RSA-codering";

"06 05 2B 24 08 01 01"				= "Teletrust SigiSigConform-beleidsidentificatie";
"06 05 2B 24 08 02 01"				= "Adreslijstvoorziening";

"06 05 2B 24 08 03 01"				= "Datum certificaataanmaak";
"06 05 2B 24 08 03 02"				= "Verwerving";
"06 05 2B 24 08 03 03"				= "Toelating";
"06 05 2B 24 08 03 04"				= "Monetaire limiet";
"06 05 2B 24 08 03 05"				= "Meerderheidsverklaring";
"06 05 2B 24 08 03 06"				= "Serienummer kaart met geïntegreerde schakeling";
"06 05 2B 24 08 03 07"				= "Verwijzing naar publieke sleutel";
"06 05 2B 24 08 03 08"				= "Beperking";
"06 05 2B 24 08 03 09"				= "Ophalen indien toegestaan";
"06 05 2B 24 08 03 0A"				= "Gevraagd certificaat";
"06 05 2B 24 08 03 0B"				= "Naamgevingsautoriteiten";
"06 05 2B 24 08 03 0C"				= "Certificaat in directory sinds";
"06 05 2B 24 08 03 0D"				= "Certificaathash";

"06 05 2B 24 08 04 01"				= "Persoonlijke gegevens";
"06 05 2B 24 08 04 08"				= "Beperking";
"06 07 2B 24 08 05 01 01 01"		= "RSA Indicate SHA-1";
"06 07 2B 24 08 05 01 01 02"		= "RSA Indicate RIPEMD-160";
"06 07 2B 24 08 05 01 01 03"		= "RSA met SHA-1";
"06 07 2B 24 08 05 01 01 04"		= "RSA met RIPEMD-160";
"06 07 2B 24 08 05 01 02 01"		= "DSA uitgebreid";
"06 07 2B 24 08 05 01 02 02"		= "DSA met RIPEMD-160";

"06 05 2B 24 08 06 01"				= "Certificaat";
"06 05 2B 24 08 06 02"				= "Certificaatverwijzing";
"06 05 2B 24 08 06 03"				= "Kenmerkcertificaat";
"06 05 2B 24 08 06 04"				= "Kenmerkverwijzing";
"06 05 2B 24 08 06 05"				= "Naam";
"06 05 2B 24 08 06 06"				= "Opslagtijd";
"06 05 2B 24 08 06 07"				= "Bestandsgrootte";
"06 05 2B 24 08 06 08"				= "Locatie";
"06 05 2B 24 08 06 09"				= "Nummer handtekening";
"06 05 2B 24 08 06 0A"				= "Autom. gegenereerd";

"06 05 2B 24 08 07 01"				= "Typen Teletrust-presentaties";
"06 06 2B 24 08 07 01 01"			= "Adobe Illustrator";
"06 06 2B 24 08 07 01 02"			= "AmiPro";
"06 06 2B 24 08 07 01 03"			= "AutoCAD";
"06 06 2B 24 08 07 01 04"			= "Binair";
"06 06 2B 24 08 07 01 05"			= "BMP";
"06 06 2B 24 08 07 01 06"			= "CGM";
"06 06 2B 24 08 07 01 07"			= "CorelCRT";
"06 06 2B 24 08 07 01 08"			= "CorelDRW";
"06 06 2B 24 08 07 01 09"			= "CorelEXC";
"06 06 2B 24 08 07 01 0A"			= "CorelPHT";
"06 06 2B 24 08 07 01 0B"			= "Draw";
"06 06 2B 24 08 07 01 0C"			= "DVI";
"06 06 2B 24 08 07 01 0D"			= "EPS";
"06 06 2B 24 08 07 01 0E"			= "Excel";
"06 06 2B 24 08 07 01 0F"			= "GEM";
"06 06 2B 24 08 07 01 10"			= "GIF";
"06 06 2B 24 08 07 01 11"			= "HPGL";
"06 06 2B 24 08 07 01 12"			= "JPEG";
"06 06 2B 24 08 07 01 13"			= "Kodak";
"06 06 2B 24 08 07 01 14"			= "LaTeX";
"06 06 2B 24 08 07 01 15"			= "Lotus";
"06 06 2B 24 08 07 01 16"			= "LotusPIC";
"06 06 2B 24 08 07 01 17"			= "MacPICT";
"06 06 2B 24 08 07 01 18"			= "MacWord";
"06 06 2B 24 08 07 01 19"			= "MSWfD";
"06 06 2B 24 08 07 01 1A"			= "MSWord";
"06 06 2B 24 08 07 01 1B"			= "MSWord2";
"06 06 2B 24 08 07 01 1C"			= "MSWord6";
"06 06 2B 24 08 07 01 1D"			= "MSWord8";
"06 06 2B 24 08 07 01 1E"			= "PDF";
"06 06 2B 24 08 07 01 1F"			= "PIF";
"06 06 2B 24 08 07 01 20"			= "PostScript";
"06 06 2B 24 08 07 01 21"			= "RTF";
"06 06 2B 24 08 07 01 22"			= "SCITEX";
"06 06 2B 24 08 07 01 23"			= "TAR";
"06 06 2B 24 08 07 01 24"			= "Targa";
"06 06 2B 24 08 07 01 25"			= "TeX";
"06 06 2B 24 08 07 01 26"			= "Tekst";
"06 06 2B 24 08 07 01 27"			= "TIFF";
"06 06 2B 24 08 07 01 28"			= "TIFF-FC";
"06 06 2B 24 08 07 01 29"			= "UID";
"06 06 2B 24 08 07 01 2A"			= "UUEncode";
"06 06 2B 24 08 07 01 2B"			= "WMF";
"06 06 2B 24 08 07 01 2C"			= "WordPerfect";
"06 06 2B 24 08 07 01 2D"			= "WPGrph";

/* Thawte */

"06 04 2B 65 01 04"					= "Thawte-certificaatuitbreiding";
"06 05 2B 65 01 04 01"				= "Sterk Extranet";

/* X.520 */

"06 02 55 04"		= "X.520-kenmerktypen";
"06 03 55 04 00"	= "Objectklasse";
"06 03 55 04 01"	= "Naam vermelding als alias";
"06 03 55 04 02"	= "Kennisinformatie";
"06 03 55 04 03"	= "Normale naam";
"06 03 55 04 04"	= "Achternaam";
"06 03 55 04 05"	= "Serienummer";
"06 03 55 04 06"	= "Naam land";
"06 03 55 04 07"	= "Naam lokatie";
"06 04 55 04 07 01"	= "Collectieve naam lokatie";
"06 03 55 04 08"	= "Naam staat of provincie";
"06 04 55 04 08 01"	= "Collectieve naam staat of provincie";
"06 03 55 04 09"	= "Adres";
"06 04 55 04 09 01"	= "Collectief adres";
"06 03 55 04 0A"	= "Naam organisatie";
"06 04 55 04 0A 01"	= "Collectieve naam organisatie";
"06 03 55 04 0B"	= "Naam organisatie-eenheid";
"06 04 55 04 0B 01"	= "Collectieve naam organisatie-eenheid";
"06 03 55 04 0C"	= "Titel";
"06 03 55 04 0D"	= "Beschrijving";
"06 03 55 04 0E"	= "Zoekhulp";
"06 03 55 04 0F"	= "Zakelijke categorie";
"06 03 55 04 10"	= "Postadres";
"06 04 55 04 10 01"	= "Collectief postadres";
"06 03 55 04 11"	= "Postcode";
"06 04 55 04 11 01"	= "Collectieve postcode";
"06 03 55 04 12"	= "Postbus";
"06 04 55 04 12 01"	= "Collectieve postbus";
"06 03 55 04 13"	= "Naam fysiek afleveradres";
"06 04 55 04 13 01"	= "Collectieve naam fysiek afleveradres";
"06 03 55 04 14"	= "Telefoonnummer";
"06 04 55 04 14 01"	= "Collectief telefoonnummer";
"06 03 55 04 15"	= "Telexnummer";
"06 04 55 04 15 01"	= "Collectief telexnummer";
"06 03 55 04 16"	= "Teletex-terminalidentificatie";
"06 04 55 04 16 01"	= "Collectieve Teletex-terminalidentificatie";
"06 03 55 04 17"	= "Faxnummer";
"06 04 55 04 17 01"	= "Collectief faxnummer";
"06 03 55 04 18"	= "X.121-adres";
"06 03 55 04 19"	= "Internationaal ISDN-nummer";
"06 04 55 04 19 01"	= "Collectief internationaal ISDN-nummer";
"06 03 55 04 1A"	= "Geregistreerd adres";
"06 03 55 04 1B"	= "Bestemmingsidentificatie";
"06 03 55 04 1C"	= "Voorkeursmethode voor levering";
"06 03 55 04 1D"	= "Presentatieadres";
"06 03 55 04 1E"	= "Context ondersteunde applicatie";
"06 03 55 04 1F"	= "Lid";
"06 03 55 04 20"	= "Eigenaar";
"06 03 55 04 21"	= "Functieverdeling";
"06 03 55 04 22"	= "Zie ook";
"06 03 55 04 23"	= "Gebruikerswachtwoord";
"06 03 55 04 24"	= "Gebruikerscertificaat";
"06 03 55 04 25"	= "CA-certificaat";
"06 03 55 04 26"	= "Lijst met ingetrokken autoriteiten";
"06 03 55 04 27"	= "Lijst met ingetrokken certificaten";
"06 03 55 04 28"	= "Kruiselings certifcaatpaar";
"06 03 55 04 29"	= "Naam";
"06 03 55 04 2A"	= "Voornaam";
"06 03 55 04 2B"	= "Initialen";
"06 03 55 04 2C"	= "Generatiekwalificatie";
"06 03 55 04 2D"	= "Unieke identificatie";
"06 03 55 04 2E"	= "DN-kwalificatie";
"06 03 55 04 2F"	= "Uitgebreide zoekhulp";
"06 03 55 04 30"	= "Protocolinformatie";
"06 03 55 04 31"	= "Speciale naam";
"06 03 55 04 32"	= "Uniek lid";
"06 03 55 04 33"	= "Huisidentificatie";
"06 03 55 04 34"	= "Ondersteunde algoritmes";
"06 03 55 04 35"	= "Lijst met ingetrokken delta's";
"06 03 55 04 36"	= "Opschonen";
"06 03 55 04 3A"	= "Kruiselings certifcaatpaar";

/* X.500 object classes */

"06 02 55 06"		= "X.520-objectklasse";
"06 03 55 06 00"	= "Boven";
"06 03 55 06 01"	= "Alias";
"06 03 55 06 02"	= "Land";
"06 03 55 06 03"	= "Locatie";
"06 03 55 06 04"	= "Organisatie";
"06 03 55 06 05"	= "Organisatie-eenheid";
"06 03 55 06 06"	= "Persoon";
"06 03 55 06 07"	= "Persoon in organisatie";
"06 03 55 06 08"	= "Functie in organisatie";
"06 03 55 06 09"	= "Groep namen";
"06 03 55 06 0A"	= "Verblijvende persoon";
"06 03 55 06 0B"	= "Applicatieproces";
"06 03 55 06 0C"	= "Applicatie-entiteit";
"06 03 55 06 0D"	= "DSA";
"06 03 55 06 0E"	= "Apparaat";
"06 03 55 06 0F"	= "Gebruiker met extra identiteitscontrole";
"06 03 55 06 10"	= "Certificaatautoriteit";
"06 03 55 06 11"	= "Groep unieke namen";
"06 03 55 06 15"	= "PKI-gebruiker";
"06 03 55 06 16"	= "PKI CA";

/* X.500 algorithms */

"06 02 55 08"		= "X.500-algoritmes";
"06 03 55 08 01"	= "X.500-coderingsalgoritmes";
"06 04 55 08 01 01"	= "RSA";

/* X.509 */

"06 02 55 1D"		= "X.509-certificaatuitbreidingen";
"06 03 55 1D 01"	= "Sleutelidentificatie autoriteit (old)";
"06 03 55 1D 02"	= "Primaire sleutelkenmerken (oud)";
"06 03 55 1D 03"	= "Certificaatbeleid (old)";
"06 03 55 1D 04"	= "Beperking sleutelgebruik (oud)";
"06 03 55 1D 05"	= "Beleidskoppeling (oud)";
"06 03 55 1D 06"	= "Beperking substructuren";
"06 03 55 1D 07"	= "Alternatieve naam onderwerp";
"06 03 55 1D 08"	= "Alternatieve naam verstrekker (oud)";
"06 03 55 1D 09"	= "Kenmerken onderwerpdirectory";
"06 03 55 1D 0A"	= "Basisbeperkingen (oud 2.5.29.10)";
"06 03 55 1D 0B"	= "Naamsbeperkingen (oud)";
"06 03 55 1D 0C"	= "Beleidsbeperkingen (oud)";
"06 03 55 1D 0D"	= "Basisbeperkingen (oud 2.5.29.13)";
"06 03 55 1D 0E"	= "Aanduiding onderwerpsleutel";
"06 03 55 1D 0F"	= "Sleutelgebruik";
"06 03 55 1D 10"	= "Gebruiksperiode private sleutel";
"06 03 55 1D 11"	= "Alternatieve naam onderwerp";
"06 03 55 1D 12"	= "Alternatieve naam verstrekker";
"06 03 55 1D 13"	= "Basisbeperkingen";
"06 03 55 1D 14"	= "Nummer op lijst met ingetrokken certificaten";
"06 03 55 1D 15"	= "Code CRL-reden";
"06 03 55 1D 16"	= "Vervaldatum (oud)";
"06 03 55 1D 17"	= "Code blokkeringsinstructie";
"06 03 55 1D 18"	= "Ongeldigheidsdatum";
"06 03 55 1D 19"	= "CRL-distributiepunten (oud)";
"06 03 55 1D 1A"	= "Verstrekkingsdistributiepunt (oud)";
"06 03 55 1D 1B"	= "Delta CRL-identificatie";
"06 03 55 1D 1C"	= "Verstrekkingsdistributiepunt";
"06 03 55 1D 1D"	= "Certificaatverstrekker";
"06 03 55 1D 1E"	= "Naamsbeperkingen";
"06 03 55 1D 1F"	= "CRL-distributiepunten";
"06 03 55 1D 20"	= "Certificaatbeleid";
"06 04 55 1D 20 00"	= "Elke beleidsidentificatie";
"06 03 55 1D 21"	= "Beleidskoppeling";
"06 03 55 1D 22"	= "Beleidsbeperkingen";
"06 03 55 1D 23"	= "Sleutelidentificatie autoriteit";
"06 03 55 1D 24"	= "Beleidsbeperkingen";
"06 03 55 1D 25"	= "Uitgebreid sleutelgebruik";
"06 04 55 1D 25 00"	= "Elk uitgebreid sleutelgebruik";

/* DMS - SDN.700 INFOSEC algorithms */

"06 09 60 86 48 01 65 02 01 01 01"	= "SDNS-handtekeningalgoritme";
"06 09 60 86 48 01 65 02 01 01 02"	= "Fortezza-handtekeningsalgoritme";
"06 09 60 86 48 01 65 02 01 01 03"	= "SDNS-vertrouwelijkheidsalgoritme";
"06 09 60 86 48 01 65 02 01 01 04"	= "Fortezza-vertrouwelijkheidsalgoritme";
"06 09 60 86 48 01 65 02 01 01 05"	= "SDNS-integriteitsalgoritme";
"06 09 60 86 48 01 65 02 01 01 06"	= "Fortezza-integriteitsalgoritme";
"06 09 60 86 48 01 65 02 01 01 07"	= "SDNS-tekenbeveiligingsalgoritme";
"06 09 60 86 48 01 65 02 01 01 08"	= "Fortezza-tekenbeveiligingsalgoritme";
"06 09 60 86 48 01 65 02 01 01 09"	= "SDNS-sleutelbeheeralgoritme";
"06 09 60 86 48 01 65 02 01 01 0A"	= "Fortezza-sleutelbeheeralgoritme";
"06 09 60 86 48 01 65 02 01 01 0B"	= "SDNS-sleutelbeheer- en handtekeningalgoritme";
"06 09 60 86 48 01 65 02 01 01 0C"	= "Fortezza-sleutelbeheer- en handtekeningalgoritme";
"06 09 60 86 48 01 65 02 01 01 0D"	= "Suite A-handtekeningalgoritme";
"06 09 60 86 48 01 65 02 01 01 0E"	= "Suite A-vertrouwelijkheidsalgoritme";
"06 09 60 86 48 01 65 02 01 01 0F"	= "Suite A-integriteitsalgoritme";
"06 09 60 86 48 01 65 02 01 01 10"	= "Suite A-tekenbeveiligingsalgoritme";
"06 09 60 86 48 01 65 02 01 01 11"	= "Suite A-sleutelbeheeralgoritme";
"06 09 60 86 48 01 65 02 01 01 12"	= "Suite A-sleutelbeheer- en handtekeningalgoritme";
"06 09 60 86 48 01 65 02 01 01 13"	= "Fortezza-handtekeningsalgoritme (bijgewerkt)";
"06 09 60 86 48 01 65 02 01 01 14"	= "Fortezza-sleutelbeheer- en handtekeningalgoritmes (bijgewerkt)";
"06 09 60 86 48 01 65 02 01 01 15"	= "Fortezza-integriteitsalgoritme (bijgewerkt)";
"06 09 60 86 48 01 65 02 01 01 16"	= "Sleuteluitwisselingsalgoritme";
"06 09 60 86 48 01 65 02 01 01 17"	= "Fortezza Wrap80-algoritme";
"06 09 60 86 48 01 65 02 01 01 18"	= "Sleutelcoderingsalgoritme (KEA)";

"06 09 60 86 48 01 65 02 01 02 01"	= "RFC 822-berichtstructuur";
"06 09 60 86 48 01 65 02 01 02 02"	= "Lege inhoud";
"06 09 60 86 48 01 65 02 01 02 03"	= "CSP-inhoudstype";
"06 09 60 86 48 01 65 02 01 02 2A"	= "MSP Rev 3-inhoudstype";
"06 09 60 86 48 01 65 02 01 02 30"	= "MSP-inhoudstype";
"06 09 60 86 48 01 65 02 01 02 31"	= "MSP Rekey Agent-protocol";
"06 09 60 86 48 01 65 02 01 02 32"	= "MSP MMP";
"06 09 60 86 48 01 65 02 01 02 42"	= "MSP Rev 3.1-inhoudstype";
"06 09 60 86 48 01 65 02 01 02 48"	= "Doorgestuurd deel MSP-berichttekst";
"06 09 60 86 48 01 65 02 01 02 49"	= "Parameters doorgestuurd MSP-bericht";
"06 09 60 86 48 01 65 02 01 02 50"	= "Doorgestuurd deel CSP-berichttekst";
"06 09 60 86 48 01 65 02 01 02 51"	= "Parameters doorgestuurd CSP-bericht";
"06 09 60 86 48 01 65 02 01 02 52"	= "MSP MMP2";

/* SDN.700 INFOSEC policy */

"06 09 60 86 48 01 65 02 01 03 01"		= "SDNS-beveiligingsbeleid";
"06 09 60 86 48 01 65 02 01 03 02"		= "SDNS PRBAC";
"06 09 60 86 48 01 65 02 01 03 03"		= "Mosaic PRBAC";

"06 09 60 86 48 01 65 02 01 03 0A"		= "Beveiligingsbeleid";
"06 0A 60 86 48 01 65 02 01 03 0A 00"	= "NASP";
"06 0A 60 86 48 01 65 02 01 03 0A 01"	= "ELCO";
"06 0A 60 86 48 01 65 02 01 03 0A 02"	= "TK";
"06 0A 60 86 48 01 65 02 01 03 0A 03"	= "DSAP";
"06 0A 60 86 48 01 65 02 01 03 0A 04"	= "SSSS";
"06 0A 60 86 48 01 65 02 01 03 0A 05"	= "DNASP";
"06 0A 60 86 48 01 65 02 01 03 0A 06"	= "BYEMAN";
"06 0A 60 86 48 01 65 02 01 03 0A 07"	= "REL-US";
"06 0A 60 86 48 01 65 02 01 03 0A 08"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 09"	= "REL-CAN";
"06 0A 60 86 48 01 65 02 01 03 0A 0A"	= "REL-UK";
"06 0A 60 86 48 01 65 02 01 03 0A 0B"	= "REL-NZ";
"06 0A 60 86 48 01 65 02 01 03 0A 0C"	= "Algemeen";

"06 09 60 86 48 01 65 02 01 03 0B"			= "genser";
"06 0A 60 86 48 01 65 02 01 03 0B 00"		= "genserNations";
"06 0A 60 86 48 01 65 02 01 03 0B 01"		= "genserComsec";
"06 0A 60 86 48 01 65 02 01 03 0B 02"		= "genserAcquisition";
"06 0A 60 86 48 01 65 02 01 03 0B 03"		= "genserSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0B 03 00"	= "genserTagSetName";

"06 09 60 86 48 01 65 02 01 03 0C"			= "Standaardbeveiligingsbeleid";
"06 09 60 86 48 01 65 02 01 03 0D"			= "capcoMarkings";
"06 0A 60 86 48 01 65 02 01 03 0D 00"		= "capcoSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0D 00 01"	= "capcoTagSetName1";
"06 0B 60 86 48 01 65 02 01 03 0D 00 02"	= "capcoTagSetName2";
"06 0B 60 86 48 01 65 02 01 03 0D 00 03"	= "capcoTagSetName3";
"06 0B 60 86 48 01 65 02 01 03 0D 00 04"	= "capcoTagSetName4";

"06 09 60 86 48 01 65 02 01 05 01"	= "SDNS-sleutelbeheercertificaat";
"06 09 60 86 48 01 65 02 01 05 02"	= "SDNS-gebruikershandtekeningcertificaat";
"06 09 60 86 48 01 65 02 01 05 03"	= "SDNS-sleutelbeheer- en handtekeningcertificaat";
"06 09 60 86 48 01 65 02 01 05 04"	= "Fortezza-sleutelbeheercertificaat";
"06 09 60 86 48 01 65 02 01 05 05"	= "Fortezza-sleutelbeheer- en handtekeningcertificaat";
"06 09 60 86 48 01 65 02 01 05 06"	= "Fortezza-gebruikershandtekeningscertificaat";
"06 09 60 86 48 01 65 02 01 05 07"	= "Fortezza-CA-ondertekeningscertificaat";
"06 09 60 86 48 01 65 02 01 05 08"	= "SDNS CA-handtekeningcertificaat";
"06 09 60 86 48 01 65 02 01 05 0A"	= "Hulpvector";
"06 09 60 86 48 01 65 02 01 05 0B"	= "Ontvangstbeleid";
"06 09 60 86 48 01 65 02 01 05 0C"	= "Lidmaatschap";
"06 09 60 86 48 01 65 02 01 05 0D"	= "Beheerders";
"06 09 60 86 48 01 65 02 01 05 0E"	= "alid";
"06 09 60 86 48 01 65 02 01 05 14"	= "janUKMs";
"06 09 60 86 48 01 65 02 01 05 15"	= "febUKMs";
"06 09 60 86 48 01 65 02 01 05 16"	= "marUKMs";
"06 09 60 86 48 01 65 02 01 05 17"	= "aprUKMs";
"06 09 60 86 48 01 65 02 01 05 18"	= "mayUKMs";
"06 09 60 86 48 01 65 02 01 05 19"	= "junUKMs";
"06 09 60 86 48 01 65 02 01 05 1A"	= "julUKMs";
"06 09 60 86 48 01 65 02 01 05 1B"	= "augUKMs";
"06 09 60 86 48 01 65 02 01 05 1C"	= "sepUKMs";
"06 09 60 86 48 01 65 02 01 05 1D"	= "octUKMs";
"06 09 60 86 48 01 65 02 01 05 1E"	= "novUKMs";
"06 09 60 86 48 01 65 02 01 05 1F"	= "decUKMs";

"06 09 60 86 48 01 65 02 01 05 28"	= "Meta SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 29"	= "SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 2A"	= "Meta SDNS-handtekening CKL";
"06 09 60 86 48 01 65 02 01 05 2B"	= "SDNS-handtekening CKL";
"06 09 60 86 48 01 65 02 01 05 2C"	= "Lijst met ingetrokken SDNS-certificaten";
"06 09 60 86 48 01 65 02 01 05 2D"	= "Fortezza-certificaatintrekkingslijst";
"06 09 60 86 48 01 65 02 01 05 2E"	= "Fortezza-CKL";
"06 09 60 86 48 01 65 02 01 05 2F"	= "Vrijgestelde adresverwerker";
"06 09 60 86 48 01 65 02 01 05 30"	= "Guard";
"06 09 60 86 48 01 65 02 01 05 31"	= "Ondersteunde algoritmes";
"06 09 60 86 48 01 65 02 01 05 32"	= "Suite A-sleutelbeheercertificaat";
"06 09 60 86 48 01 65 02 01 05 33"	= "Suite A-sleutelbeheer- en handtekeningcertificaat";
"06 09 60 86 48 01 65 02 01 05 34"	= "Suite A-gebruikershandtekeningcertificaat";
"06 09 60 86 48 01 65 02 01 05 35"	= "PRBAC-info";
"06 09 60 86 48 01 65 02 01 05 36"	= "PRBAC CA-beperkingen";
"06 09 60 86 48 01 65 02 01 05 37"	= "Handtekening- of sleutelbeheerbevoegdheden";
"06 09 60 86 48 01 65 02 01 05 38"	= "Comm-bevoegdheden";
"06 09 60 86 48 01 65 02 01 05 39"	= "Gelabeld kenmerk";
"06 09 60 86 48 01 65 02 01 05 3A"	= "Beleidsinformatiebestand";
"06 09 60 86 48 01 65 02 01 05 3B"	= "Informatiebestand beveiligingsbeleid";
"06 09 60 86 48 01 65 02 01 05 3C"	= "CA-opschoningsbeperking";

"06 09 60 86 48 01 65 02 01 07 01"		= "CSP-uitbreidingen";
"06 0A 60 86 48 01 65 02 01 07 01 00"	= "cspCsExtn";
"06 09 60 86 48 01 65 02 01 08 01"		= "ISSI-beveiligingscategorieën";
"06 09 60 86 48 01 65 02 01 08 02"		= "Standaardbeveiligingslabelbevoegdheden";

"06 09 60 86 48 01 65 02 01 0A 01"			= "Handtekeningsbevoegdheden";
"06 09 60 86 48 01 65 02 01 0A 02"			= "Sleutelbeheerbevoegdheden";
"06 09 60 86 48 01 65 02 01 0A 03"			= "Benoemde tagset-bevoegdheid";
"06 09 60 86 48 01 65 02 01 0B 01"			= "Demo Ver. Koninkrijk";
"06 09 60 86 48 01 65 02 01 0B 02"			= "US Department of Defense Class 2";
"06 09 60 86 48 01 65 02 01 0B 03"			= "US Medium Pilot";
"06 09 60 86 48 01 65 02 01 0B 04"			= "US Department of Defense Class 4";
"06 09 60 86 48 01 65 02 01 0B 05"			= "US Department of Defense Class 3";
"06 09 60 86 48 01 65 02 01 0B 06"			= "US Department of Defense Class 5";
"06 09 60 86 48 01 65 02 01 0B 09"			= "US Department of Defense PKI Class 3";

"06 09 60 86 48 01 65 02 01 0C 00"			= "Test beveiligingsbeleid";
"06 0A 60 86 48 01 65 02 01 0C 00 01"		= "TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00"	= "TSP1-beveiligingscategorieën";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 00"	= "TSP1-tagset nul";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 01"	= "TSP1-tagset één";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 02"	= "TSP1-tagset twee";
"06 0A 60 86 48 01 65 02 01 0C 00 02"		= "TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00"	= "TSP2-beveiligingscategorieën";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 00"	= "TSP2-tagset nul";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 01"	= "TSP2-tagset één";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 02"	= "TSP2-tagset twee";

"06 0A 60 86 48 01 65 02 01 0C 00 03"		= "Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00"	= "Kafka-beveiligingscategorieën";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 01"	= "Kafka-tagsetnaam 1";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 02"	= "Kafka-tagsetnaam 2";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 03"	= "Kafka-tagsetnaam 3";

"06 0A 60 86 48 01 65 02 01 0C 01 01"		= "TCP1";
"06 09 60 86 48 01 65 02 01 0C 02"			= "Test CRL-vermelding";

/* CSOR GAK-FIPS */

"06 07 60 86 48 01 65 03 01"			= "Etiket";
"06 07 60 86 48 01 65 03 02"			= "PKI";
"06 08 60 86 48 01 65 03 02 01"			= "GAK-beleidsidentificatie";
"06 0A 60 86 48 01 65 03 02 01 03 01"	= "Identificatie rudimentair FBCA-beleid";
"06 0A 60 86 48 01 65 03 02 01 03 02"	= "Identificatie FBCA-basisbeleid";
"06 0A 60 86 48 01 65 03 02 01 03 03"	= "Identificatie medium FBCA-beleid";
"06 0A 60 86 48 01 65 03 02 01 03 04"	= "Identificatie hoog FBCA-beleid";
"06 08 60 86 48 01 65 03 02 02"			= "GAK";
"06 09 60 86 48 01 65 03 02 02 01"		= "KRA-sleutel";
"06 08 60 86 48 01 65 03 02 03"			= "Uitbreidingen";
"06 09 60 86 48 01 65 03 02 03 01"		= "Sleutelhersteltechniek";
"06 09 60 86 48 01 65 03 02 03 02"		= "Geschikt voor sleutelherstel";
"06 09 60 86 48 01 65 03 02 03 03"		= "Sleutelherstel";
"06 08 60 86 48 01 65 03 02 04"			= "Sleutelherstelschema's";
"06 08 60 86 48 01 65 03 02 05"			= "CSOR GAK-uitbreiding";
"06 07 60 86 48 01 65 03 03"			= "ARPA";

/* CSOR (NIST) Algorithms */

"06 07 60 86 48 01 65 03 04"			= "NIST-algoritme";
"06 08 60 86 48 01 65 03 04 01"			= "AES";
"06 09 60 86 48 01 65 03 04 01 01"		= "AES 128-ECB";
"06 09 60 86 48 01 65 03 04 01 02"		= "AES 128-CBC";
"06 09 60 86 48 01 65 03 04 01 03"		= "AES 128-OFB";
"06 09 60 86 48 01 65 03 04 01 04"		= "AES 128-CFB";
"06 09 60 86 48 01 65 03 04 01 15"		= "AES 192-ECB";
"06 09 60 86 48 01 65 03 04 01 16"		= "AES 192-CBC";
"06 09 60 86 48 01 65 03 04 01 17"		= "AES 192-OFB";
"06 09 60 86 48 01 65 03 04 01 18"		= "AES 192-CFB";
"06 09 60 86 48 01 65 03 04 01 29"		= "AES 256-ECB";
"06 09 60 86 48 01 65 03 04 01 2A"		= "AES 256-CBC";
"06 09 60 86 48 01 65 03 04 01 2B"		= "AES 256-OFB";
"06 09 60 86 48 01 65 03 04 01 2C"		= "AES 256-CFB";

/* NIST secure hash algorithms */

"06 08 60 86 48 01 65 03 04 02"         = "SHA";
"06 09 60 86 48 01 65 03 04 02 01"      = "SHA-256";
"06 09 60 86 48 01 65 03 04 02 02"      = "SHA-384";
"06 09 60 86 48 01 65 03 04 02 03"      = "SHA-512";
"06 09 60 86 48 01 65 03 04 02 04"      = "SHA-224";

/* Novell */

"06 0A 60 86 48 01 86 F8 37 01 02 08"		= "Novell-algoritme";
"06 0B 60 86 48 01 86 F8 37 01 02 08 16"	= "DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 17"	= "DES-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 18"	= "DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 19"	= "DES-EDE2-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1A"	= "DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1B"	= "DES-EDE3-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1C"	= "RC5-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1D"	= "MD2 met RSA-codering BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1E"	= "MD5 met RSA-codering BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1F"	= "SHA-1 met RSA-codering BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 20"	= "LM-verwerking";
"06 0B 60 86 48 01 86 F8 37 01 02 08 28"	= "MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 32"	= "MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 33"	= "IKE HMAC met SHA1-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 34"	= "IKE HMAC met MD5-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 45"	= "RC2-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 52"	= "SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5C"	= "RC2-CBC BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5F"	= "MD4";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 02"	= "MD4-pakket";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 03"	= "RSA-codering BSAFE1";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 04"	= "NW-wachtwoord";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 05"	= "Novell Obfuscate-1";

"06 09 60 86 48 01 86 F8 37 01 09"			= "PKI";
"06 0A 60 86 48 01 86 F8 37 01 09 04"		= "Type PKI-kenmerk";
"06 0B 60 86 48 01 86 F8 37 01 09 04 01"	= "Beveiligingskenmerken";
"06 0B 60 86 48 01 86 F8 37 01 09 04 02"	= "Betrouwbaarheidslimiet";

/* Netscape */

"06 07 60 86 48 01 86 F8 42"		= "Netscape-objectidentificatie";
"06 08 60 86 48 01 86 F8 42 01"		= "Netscape-certificaatuitbreiding";
"06 09 60 86 48 01 86 F8 42 01 01"	= "Type Netscape-certificaat";
"06 09 60 86 48 01 86 F8 42 01 02"	= "Netscape-basis-URL";
"06 09 60 86 48 01 86 F8 42 01 03"	= "Netscape-intrekkings-URL";
"06 09 60 86 48 01 86 F8 42 01 04"	= "Netscape CA-intrekkings-URL";
"06 09 60 86 48 01 86 F8 42 01 05"	= "Netscape CRL-download-URL";
"06 09 60 86 48 01 86 F8 42 01 06"	= "Netscape CA-certificaatdownload-URL";
"06 09 60 86 48 01 86 F8 42 01 07"	= "Netscape-certificaatvernieuwings-URL";
"06 09 60 86 48 01 86 F8 42 01 08"	= "Netscape CA-beleids-URL";
"06 09 60 86 48 01 86 F8 42 01 09"	= "Netscape-certificaatthuispagina-URL";
"06 09 60 86 48 01 86 F8 42 01 0A"	= "Netscape-certificaatsentiteitslogo";
"06 09 60 86 48 01 86 F8 42 01 0B"	= "Afbeelding gebruiker Netscape-certificaat";
"06 09 60 86 48 01 86 F8 42 01 0C"	= "Netscape SSL-servernaam";
"06 09 60 86 48 01 86 F8 42 01 0D"	= "Netscape-certificaatopmerkingen";

"06 08 60 86 48 01 86 F8 42 02"		= "Netscape-gegevenstype";
"06 09 60 86 48 01 86 F8 42 02 01"	= "image/GIF";
"06 09 60 86 48 01 86 F8 42 02 02"	= "image/JPEG";
"06 09 60 86 48 01 86 F8 42 02 03"	= "URL";
"06 09 60 86 48 01 86 F8 42 02 04"	= "text/HTML";

"06 09 60 86 48 01 86 F8 42 02 05"	= "Netscape-certificaatreeks";
"06 09 60 86 48 01 86 F8 42 02 06"	= "Netscape-certificaat-URL";

"06 08 60 86 48 01 86 F8 42 03"			= "Netscape Directory-objectidentificatie";
"06 09 60 86 48 01 86 F8 42 03 01"		= "LDAP-definities";
"06 0A 60 86 48 01 86 F8 42 03 01 01"	= "Autolicentie";
"06 0A 60 86 48 01 86 F8 42 03 01 02"	= "Afdelingsnummer";
"06 0A 60 86 48 01 86 F8 42 03 01 03"	= "Werknemersnummer";
"06 0A 60 86 48 01 86 F8 42 03 01 04"	= "Type werknemer";
"06 0A 60 86 48 01 86 F8 42 03 02 02"	= "Persoon in intranetorganisatie";

"06 09 60 86 48 01 86 F8 42 04 01"		= "Server Gated Crypto";

/* Verisign */

/* Country, zip, date of birth (age), and gender of cert owner (CZAG) in obfuscated form */
"06 0A 60 86 48 01 86 F8 45 01 06 03"	= "Verisign CZAG";

/* Text string used in certs issued to Netscape InBox customers */
"06 0A 60 86 48 01 86 F8 45 01 06 06"	= "Verisign InBox";

"06 0A 60 86 48 01 86 F8 45 01 06 0B"	= "Onbekende Verisign-VPN-uitbreiding";
"06 0A 60 86 48 01 86 F8 45 01 06 0D"	= "Onbekende Verisign-VPN-uitbreiding";

"06 0B 60 86 48 01 86 F8 45 01 07 01 01"	= "Verisign-beleidsidentificatie";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 01"	= "Verisign CPS v1-bericht";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 02"	= "Verisign CPS v1 NSI";

"06 0A 60 86 48 01 86 F8 45 01 08 01"		= "Verisign SGC CA";

/* SET */

"06 03 67 2A 00"	= "Type inhoud";
"06 04 67 2A 00 00"	= "PAN-gegevens";
"06 04 67 2A 00 01"	= "PAN-teken";
"06 04 67 2A 00 02"	= "Alleen PAN";

"06 03 67 2A 01"	= "Berichtuitbreiding";
"06 03 67 2A 02"	= "Veld";
"06 04 67 2A 02 00"	= "Volledige naam";
"06 04 67 2A 02 01"	= "Voornaam";
"06 04 67 2A 02 02"	= "Achternaam";
"06 04 67 2A 02 03"	= "Achternaam bij geboorte";
"06 04 67 2A 02 04"	= "Plaatsnaam";
"06 04 67 2A 02 05"	= "Identificatienummer";
"06 04 67 2A 02 06"	= "Maand";
"06 04 67 2A 02 07"	= "Datum";
"06 04 67 2A 02 08"	= "Adres";
"06 04 67 2A 02 09"	= "Telefoon";
"06 04 67 2A 02 0A"	= "Bedrag";
"06 04 67 2A 02 0B"	= "Accountnummer";
"06 04 67 2A 02 0C"	= "Wachtzin";

"06 03 67 2A 03"		= "Kenmerk";
"06 04 67 2A 03 00"		= "Certificaat";
"06 05 67 2A 03 00 00"	= "Duimafdruk rootsleutel";
"06 05 67 2A 03 00 01"	= "Aanvullend beleid";

"06 03 67 2A 04"	= "Algoritme";
"06 03 67 2A 05"	= "Beleid";
"06 04 67 2A 05 00"	= "Nulpunt";
"06 03 67 2A 06"	= "Module";
"06 03 67 2A 07"	= "Certificaatuitbreiding";
"06 04 67 2A 07 00"	= "Hashed-rootsleutel";
"06 04 67 2A 07 01"	= "Certificaattype";
"06 04 67 2A 07 02"	= "Handelaarsgegevens";
"06 04 67 2A 07 03"	= "Kaartcertificaat vereist";
"06 04 67 2A 07 04"	= "Tunneling";
"06 04 67 2A 07 05"	= "SET-uitbreidingen";
"06 04 67 2A 07 06"	= "SET-kwalificatie";

"06 03 67 2A 08"	= "Merk";
"06 04 67 2A 08 01"		= "IATA-ATA";
"06 04 67 2A 08 04"		= "VISA";
"06 04 67 2A 08 05"		= "MasterCard";
"06 04 67 2A 08 1E"		= "Diners";
"06 04 67 2A 08 22"		= "American Express";
"06 05 67 2A 08 AE 7B"	= "Novus";

"06 03 67 2A 09"	= "Leverancier";
"06 04 67 2A 09 00"	= "GlobeSet";
"06 04 67 2A 09 01"	= "IBM";
"06 04 67 2A 09 02"	= "CyberCash";
"06 04 67 2A 09 03"	= "Terisa";
"06 04 67 2A 09 04"	= "RSADSI";
"06 04 67 2A 09 05"	= "VeriFone";
"06 04 67 2A 09 06"	= "TrinTech";
"06 04 67 2A 09 07"	= "BankGate";
"06 04 67 2A 09 08"	= "GTE";
"06 04 67 2A 09 09"	= "CompuSource";
"06 04 67 2A 09 0A"	= "Griffin";
"06 04 67 2A 09 0B"	= "Certicom";
"06 04 67 2A 09 0C"	= "OSS";
"06 04 67 2A 09 0D"	= "TenthMountain";
"06 04 67 2A 09 0E"	= "Antares";
"06 04 67 2A 09 0F"	= "ECC";
"06 04 67 2A 09 10"	= "Maithean";
"06 04 67 2A 09 11"	= "Netscape";
"06 04 67 2A 09 12"	= "Verisign";
"06 04 67 2A 09 13"	= "BlueMoney";
"06 04 67 2A 09 14"	= "Lacerte";
"06 04 67 2A 09 15"	= "Fujitsu";
"06 04 67 2A 09 16"	= "eLab";
"06 04 67 2A 09 17"	= "Entrust";
"06 04 67 2A 09 18"	= "VIAnet";
"06 04 67 2A 09 19"	= "III";
"06 04 67 2A 09 1A"	= "OpenMarket";
"06 04 67 2A 09 1B"	= "Lexem";
"06 04 67 2A 09 1C"	= "Intertrader";
"06 04 67 2A 09 1D"	= "Persimmon";
"06 04 67 2A 09 1E"	= "NABLE";
"06 04 67 2A 09 1F"	= "espace-net";
"06 04 67 2A 09 20"	= "Hitachi";
"06 04 67 2A 09 21"	= "Microsoft";
"06 04 67 2A 09 22"	= "NEC";
"06 04 67 2A 09 23"	= "Mitsubishi";
"06 04 67 2A 09 24"	= "NCR";
"06 04 67 2A 09 25"	= "e-COMM";
"06 04 67 2A 09 26"	= "Gemplus";

"06 03 67 2A 0A"	= "Nationaal";
"06 05 67 2A 0A E2 00"	= "Japan";

/* Draft SET (deprecated) */

"06 04 86 8D 6F 02"	= "Hashed-rootsleutel";
"06 04 86 8D 6F 03"	= "Certificaattype";
"06 04 86 8D 6F 04"	= "Handelaarsgegevens";
"06 04 86 8D 6F 05"	= "Kaartcertificaat vereist";
"06 04 86 8D 6F 06"	= "Tunneling";
"06 04 86 8D 6F 07"	= "SET-kwalificatie";
"06 04 86 8D 6F 63"	= "SET-gegevens";

/* Apple */

"06 06 2A 86 48 86 F7 63"		= "Apple";
"06 07 2A 86 48 86 F7 63 64"	= "Apple gegevensbeveiliging";

"06 08 2A 86 48 86 F7 63 64 01" = "Apple Trust-beleidsidentificatie";
"06 09 2A 86 48 86 F7 63 64 01 01"  = "Apple iSign-beleid";
"06 09 2A 86 48 86 F7 63 64 01 02"  = "Apple X.509-basisbeleid";
"06 09 2A 86 48 86 F7 63 64 01 03"  = "Apple SSL-beleid";
"06 09 2A 86 48 86 F7 63 64 01 04"  = "Apple beleid voor aanmaak lokale certificaten";
"06 09 2A 86 48 86 F7 63 64 01 05"  = "Apple beleid voor aanmaak lokale CSR-certificaten";
"06 09 2A 86 48 86 F7 63 64 01 06"  = "Apple CRL-intrekkingsbeleid";
"06 09 2A 86 48 86 F7 63 64 01 07"  = "Apple OCSP-intrekkingsbeleid";
"06 09 2A 86 48 86 F7 63 64 01 08"  = "Apple S/MIME-beleid";
"06 09 2A 86 48 86 F7 63 64 01 09"  = "Apple beleid voor uitbreidbare identiteitscontrole";
"06 09 2A 86 48 86 F7 63 64 01 0A"  = "Apple Software-update-ondertekeningsbeleid";
"06 09 2A 86 48 86 F7 63 64 01 0B"  = "Apple IPsec-beleid";
"06 09 2A 86 48 86 F7 63 64 01 0C"  = "Apple iChat-beleid";
"06 09 2A 86 48 86 F7 63 64 01 0D"  = "Apple resource-ondertekeningsbeleid";
"06 09 2A 86 48 86 F7 63 64 01 0E"  = "Apple Kerberos-clientbeleid";
"06 09 2A 86 48 86 F7 63 64 01 0F"  = "Apple Kerberos-serverbeleid";
"06 09 2A 86 48 86 F7 63 64 01 10"  = "Apple codeondertekeningsbeleid";
"06 09 2A 86 48 86 F7 63 64 01 11"  = "Apple pakketondertekeningsbeleid";

"06 08 2A 86 48 86 F7 63 64 02" = "Apple-beveiligingsalgoritme-identificatie";
"06 09 2A 86 48 86 F7 63 64 02 01"  = "FEE (Fast Elliptic Encryption)";
"06 09 2A 86 48 86 F7 63 64 02 02"  = "ASC (Apple Secure Compression)";
"06 09 2A 86 48 86 F7 63 64 02 03"  = "FEE met MD5-handtekening";
"06 09 2A 86 48 86 F7 63 64 02 04"  = "FEE met SHA-1-handtekening";
"06 09 2A 86 48 86 F7 63 64 02 05"  = "Apple FEED-codering";
"06 09 2A 86 48 86 F7 63 64 02 06"  = "Apple FEED (experimenteel)";
"06 09 2A 86 48 86 F7 63 64 02 07"  = "FEE met ECDSA-handtekening";

"06 08 2A 86 48 86 F7 63 64 03" = "Apple .Mac-certificaataanduiding";
"06 09 2A 86 48 86 F7 63 64 03 01"  = "Apple .Mac-certificaatverzoek";
"06 0A 2A 86 48 86 F7 63 64 03 01 01"  = "Apple .Mac-certificaatverzoek identiteit";
"06 0A 2A 86 48 86 F7 63 64 03 01 02"  = "Apple .Mac-certificaatverzoek e-mailondertekening";
"06 0A 2A 86 48 86 F7 63 64 03 01 03"  = "Apple .Mac-certificaatverzoek e-mailcodering";
"06 0A 2A 86 48 86 F7 63 64 03 01 04"  = "Apple .Mac-archieflijstverzoek";
"06 0A 2A 86 48 86 F7 63 64 03 01 05"  = "Apple .Mac-archiefopnameverzoek";
"06 0A 2A 86 48 86 F7 63 64 03 01 06"  = "Apple .Mac-archiefopvraagverzoek";
"06 0A 2A 86 48 86 F7 63 64 03 01 07"  = "Apple .Mac-archiefverwijderingsverzoek";
"06 09 2A 86 48 86 F7 63 64 03 02"  = "Apple .Mac-certificaatuitbreiding";
"06 0A 2A 86 48 86 F7 63 64 03 02 01"   = "Apple .Mac-identiteit";
"06 0A 2A 86 48 86 F7 63 64 03 02 02"   = "Apple .Mac-e-mailondertekening";
"06 0A 2A 86 48 86 F7 63 64 03 02 03"   = "Apple .Mac-e-mailcodering";
"06 09 2A 86 48 86 F7 63 64 03 03"  = "Apple .Mac-certificaatverzoekwaarde";
"06 0A 2A 86 48 86 F7 63 64 03 03 01"  = "Gebruikersnaam";
"06 0A 2A 86 48 86 F7 63 64 03 03 02"  = "Wachtwoord";
"06 0A 2A 86 48 86 F7 63 64 03 03 03"  = "Hostnaam";
"06 0A 2A 86 48 86 F7 63 64 03 03 04"  = "Vernieuwingsmarkering";
"06 0A 2A 86 48 86 F7 63 64 03 03 05"  = "Asynchrone markering";

"06 08 2A 86 48 86 F7 63 64 04" = "Apple uitgebreid sleutelgebruik";
"06 09 2A 86 48 86 F7 63 64 04 01"  = "Apple codeondertekening";
"06 0A 2A 86 48 86 F7 63 64 04 01 01"  = "Apple codeondertekening (ontwikkeling)";
"06 0A 2A 86 48 86 F7 63 64 04 01 02"  = "Apple Software-update-ondertekening";
"06 0A 2A 86 48 86 F7 63 64 04 01 03"  = "Apple codeondertekening (gereserveerd)";
"06 0A 2A 86 48 86 F7 63 64 04 01 04"  = "Apple-resource-ondertekening";
"06 09 2A 86 48 86 F7 63 64 04 02"  = "Apple iChat-ondertekening";
"06 09 2A 86 48 86 F7 63 64 04 03"  = "Apple iChat-codering";
"06 09 2A 86 48 86 F7 63 64 04 04"  = "Apple systeemidentiteit";

"06 08 2A 86 48 86 F7 63 64 05" = "Apple certificaatbeleid";
"06 09 2A 86 48 86 F7 63 64 05 01"  = "Apple certificaatbeleid";
"06 09 2A 86 48 86 F7 63 64 05 02"  = "Apple .Mac-certificaatbeleid";

/* Extended key usage */

"06 04 55 1D 25 03"					= "Codeondertekening";

/* Intel CDSA-specific */

"06 07 60 86 48 01 86 F8 4D"	= "Intel";
"06 08 60 86 48 01 86 F8 4D 02"	= "Intel CDSA-beveiliging";

"06 09 60 86 48 01 86 F8 4D 02 01"	= "Intel CDSA-beveiligingsstructuren";
"06 0B 60 86 48 01 86 F8 4D 02 01 01 01"	= "X.509v3-certificaatuitbreidingen";
"06 0C 60 86 48 01 86 F8 4D 02 01 01 01 32"	= "Private X.509v3-certificaatuitbreidingen";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 01"	= "Handtekeningbitmap persoon";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 02"	= "Afbeelding persoon";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 03"	= "E-mailadres persoon";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 04"	= "Gebruik ontheffingen";

"06 0A 60 86 48 01 86 F8 4D 02 02 05"	= "Intel CDSA-beveiligingsalgoritmen";
"06 0B 60 86 48 01 86 F8 4D 02 02 05 51"	= "SHA-1 met ECDSA";

/* end */
